[
    {
        "url": "https://tibia.fandom.com/wiki/Enraged_Morshabaal",
        "name": "Enraged Morshabaal",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/b/b4/Enraged_Morshabaal.gif/revision/latest?cb=20220123032216&path-prefix=en",
        "attributes": {},
        "notes": "It is a stronger version of Morshabaal and shares most of its properties with it, except that it takes less damage and can become Furious Morshabaal.",
        "abilities": [
            "Melee (?)",
            "Great Energy Beam (5500+) Enraged Morshabaal",
            "Musical Beam (?) Enraged Morshabaal",
            "Death Bomb (?) Enraged Morshabaal",
            "Fire Explosion (?) Enraged Morshabaal",
            "Fire Ball (?) Enraged Morshabaal",
            "Ice Chain (damage increases for each player hit) (?-30,000+) Enraged Morshabaal"
        ],
        "resistance": [
            "Physical 50%?",
            "Death 50%?",
            "Holy 50%?",
            "Ice 50%?",
            "Fire 50%?",
            "Energy 50%",
            "Earth 50%?"
        ],
        "location": "Morshabaal appears inside a teleporter that spawns at the stone circle in the northwest of Edron, here. Only characters of level 150 or higher can enter",
        "strategy": "See Morshabaal.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Furious_Morshabaal",
        "name": "Furious Morshabaal",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/34/Furious_Morshabaal.gif/revision/latest?cb=20220123032215&path-prefix=en",
        "attributes": {},
        "notes": "It is a stronger version of Morshabaal and Enraged Morshabaal and shares most of its properties with them, except that it takes less damage and reflects more damage.",
        "abilities": [
            "Melee",
            "Reflect Damage (8300%)",
            "Great Energy Beam (5500+) Furious Morshabaal",
            "Musical Beam (?) Furious Morshabaal",
            "Death Bomb (?) Furious Morshabaal",
            "Fire Explosion (?) Furious Morshabaal",
            "Fire Ball (1500+) Furious Morshabaal",
            "Ice Chain (damage increases for each player hit) (1500~30000+) Furious Morshabaal"
        ],
        "resistance": [
            "Physical 50%?",
            "Death 50%?",
            "Holy 50%?",
            "Ice 50%?",
            "Fire 50%?",
            "Energy 50%",
            "Earth 50%?"
        ],
        "location": "Morshabaal appears inside a teleporter that spawns at the stone circle in the northwest of Edron, here. Only characters of level 150 or higher can enter",
        "strategy": "See Morshabaal.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Horadron",
        "name": "Horadron",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/e0/Horadron.gif/revision/latest?cb=20220627140455&path-prefix=en",
        "attributes": {},
        "notes": "You can fight this boss if you have a Copper Prison Key, obtainable from an Unrealized Dream. To use it, go to Roshamuul Prison and use it while standing on the respective platform. You can only fight this boss alone.",
        "abilities": [
            "Melee (0-600)",
            "Poison Berserk (100-250)",
            "Another kind of Poison Berserk",
            "Poison Beam (500-900)",
            "Envenom (?)",
            "Self-Healing (400-700, slow)",
            "Poison Wave (500-900)",
            "Summons (1-2 Defiler )"
        ],
        "resistance": [
            "Physical 90%",
            "Death 100%",
            "Holy 140%",
            "Ice 70%",
            "Fire 70%",
            "Energy 70%",
            "Earth 70%"
        ],
        "location": "Roshamuul Prison",
        "behaviour": "Unknown.",
        "strategy": "Unknown.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Small Ruby",
            "Cluster of Solace",
            "Demon Horn",
            "Demonic Essence",
            "Unrealized Dream",
            "Dream Matter",
            "Spellbook of Warding",
            "Beastslayer Axe",
            "Small Sapphire",
            "Crown Armor",
            "Crown Legs",
            "Lightning Legs",
            "Knight Legs",
            "Small Diamond",
            "Dream Warden Mask",
            "Small Topaz",
            "Steel Boots",
            "Blue Robe",
            "Golden Armor",
            "Noble Axe",
            "Small Emerald",
            "Spellbook of Mind Control",
            "Small Amethyst",
            "Golden Legs",
            "Vile Axe",
            "Executioner",
            "Butcher's Axe",
            "Spellscroll of Prophecies",
            "Spellbook of Lost Souls",
            "Great Axe",
            "Demonwing Axe",
            "Spellbook of Dark Mysteries",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Morshabaal",
        "name": "Morshabaal",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/c/ca/Morshabaal.gif/revision/latest?cb=20220107140053&path-prefix=en",
        "attributes": {},
        "abilities": [
            "Melee (1000-2500)",
            "Great Energy Beam (5500+) Morshabaal",
            "Musical Beam (?) Morshabaal",
            "Death Bomb (2000+) Morshabaal",
            "Fire Explosion (?) Morshabaal",
            "Fire Ball (?) Morshabaal",
            "Ice Chain \"Increases per player hit\" (4,000 - 30,000+) Morshabaal"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 95%",
            "Energy 95%",
            "Earth 100%?"
        ],
        "location": "Morshabaal appears inside a teleporter that spawns at the stone circle in the northwest of Edron, here. Only characters of level 150 or higher can enter.",
        "behaviour": "Morshabaal will retreat at very low health.Morshabaal attacks in melee range.",
        "strategy": "Morshabaal has 3 stages with increasing strength: It will always have a counter next to its name: The stronger forms of Morshabaal take less damage and do more Damage Reflection, so the team must always focus on keeping it in the regular Morshabaal stage. Even though it is still possible to deal damage to it in the enraged form, it will not be very efficient. When it is in Furious stage, it will take very little damage and reflect a lot more of it, so teams should avoid reaching this stage as it is both dangerous and expensive to fight it. While being targeted, the blockers will slowly build up a counter next to their name as well. When this counter reaches 20, the character will take more damage and Morshabaal will heal more through Lifesteal. The counter can be decreased by letting another blocker be the target. The common strategy for killing Morshabaal is the following: The blockers (preferably 3 level 600+ Elite Knights) bring Morshabaal to the north-east corner of the room and trap it next to one of the pillars. All shooters must stack diagonally near the eastern wall between two pillars. Players should only attack when the counter is above 5 and stop before it changes to the red symbol. The blockers should keep switching positions and taking turns at blocking it so that all knights can reduce their counters. Keep repeating the process of attacking and waiting to slowly reduce Morshabaal's health until it is defeated. There are several key factors that must be taken into account during the fight:",
        "loot": [
            "Morshabaal's Brain",
            "Morshabaal's Extract",
            "Morshabaal's Mask",
            "Green Demon Armor",
            "Green Demon Helmet",
            "Green Demon Legs",
            "Green Demon Slippers",
            "Platinum Coin",
            "Crystal Coin",
            "Watermelon Tourmaline (Pear)",
            "Watermelon Tourmaline (Slice)",
            "Giant Emerald",
            "Bar of Gold",
            "Dragon Figurine",
            "Ultimate Health Potion",
            "Unicorn Figurine",
            "Ultimate Spirit Potion",
            "Ultimate Mana Potion",
            "Amber with a Dragonfly",
            "Sea Horse Figurine",
            "Thunder Hammer",
            "Watermelon Tourmaline",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Orshabaal",
        "name": "Orshabaal",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/c/ce/Orshabaal.gif/revision/latest?cb=20221126165234&path-prefix=en",
        "attributes": {},
        "notes": "It's a Demon Lord - lesser of the Demon Overlord (which are yet to plague Tibia) but still dangerous.\nWhenever you think the world is safe and all the monsters have been killed, when you least expect it, Orshabaal surfaces. It is a Demon Lord who normally hides very deep down in the depths of The Edron Hero Cave.\nIts magical and physical powers are overwhelming! Many brave heroes have fallen by the great fireball and energy beam it utilizes. To make matters worse, it flees when it reaches red health, and if the adventurers are not fast enough in killing it, Orshabaal's vile healing magic will allow it to return to the fray. Whenever it chooses to raid a world it won't come alone, it brings a lot of Demons as company to help spread death and disaster. Even though Orshabaal has since lost his title of strongest monster, he remains the most infamous, due to his spawn location on the surface (the Triangle of Terror hide deep below the surface, and Ferumbras sits at the very top of his citadel). You are able to use Blessed Wooden Stake on his corpse as well as on all his summoned demon's corpses, in order to get Demon Dust. Sometimes Orshabaal gets trapped by his own Demons because he doesn't kill his summons like Scarabs kill Larvas. Orshabaal was first sighted on Pacera, Aug 26th 2005.\nHe was first killed on Titania, Sept 11th 2005. To all players on the world it appears, 3 messages are broadcasted in white text.",
        "abilities": [
            "Melee (0-1991)",
            "Mana Drain Strike (300-600) Orshabaal",
            "Mana Poison Bomb (150-350) Orshabaal",
            "Debuff (Reduces Distance by 50-90% for 6 seconds) Orshabaal",
            "Fire Ball (310-600) Orshabaal",
            "Creates Fire Fields Orshabaal",
            "Energy Beam (500-850) Orshabaal",
            "Self-Healing (1500-2500) Orshabaal",
            "Self-Healing (600-1000) Orshabaal",
            "Haste Orshabaal",
            "Summons (1-4 demon )"
        ],
        "resistance": [
            "Physical 80%<?",
            "Death 50%",
            "Holy 101%>?",
            "Ice 101%>?",
            "Fire 0%",
            "Energy 20%",
            "Earth 0%"
        ],
        "location": "North of Edron near the Dragon Lair in the stone circle (here).",
        "behaviour": "Attacks in melee range. Orshabaal will retreat at 2500  (11.11%, red) health.",
        "strategy": "Nowadays, Orshabaal will most likely die in a few seconds because of the high number of players who will be waiting for it. In such cases, the best strategy is try to position yourself around its spawn location and attack it as soon as possible when it appears. If the server is new, or if there are few players online, you may use the strategy that was for a long time the only way to kill this once-fearsome boss. Lure it to the famous spot near the entrance of Cyclopolis. When it is at red health, shoot Magic Walls so it cannot run away. The blocker should party mode with the shooters and get the loot as soon as possible after killing it.\nSince it is likely the blocker will not be able to heal quickly enough when Orshabaal performs a strong combo, it is advised to have at least a few mages using Ultimate Healing or Exura Sio on the blocker. A good strategy is luring Orshabaal into a place that you can block only him between 2 trees, or in a corridor where 1-2 Demons limit its movement, helping avoid the line-of-sight attacks. Also its possible to use a medium level char (or a low level) as bait to lure him in a place where he will get trapped by his summons, after that people can easily shoot and Orshabaal will not move until its near death. Also, keep in mind that when the blocker is blocking Orshabaal, it will still tend to use Great Fireball and Great Energy Beam, so you may want to stand diagonally and far away from it to avoid these attacks or you may experience a quick death.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Small Amethyst",
            "Black Pearl",
            "Small Emerald",
            "Small Sapphire",
            "Talon",
            "Demonic Essence",
            "Demon Horn",
            "Gold Ingot",
            "Small Diamond",
            "White Pearl",
            "Assassin Star",
            "Ring of Healing",
            "Protection Amulet",
            "Ring of the Sky",
            "Death Ring",
            "Energy Ring",
            "Might Ring",
            "Stealth Ring",
            "Gold Ring",
            "Crystal Ring",
            "Teddy Bear",
            "Green Gem",
            "Blue Gem",
            "Golden Mug",
            "Purple Tome",
            "Orb",
            "Ultimate Health Potion",
            "Great Spirit Potion",
            "Great Health Potion",
            "Great Mana Potion",
            "Magic Light Wand",
            "Life Crystal",
            "Crystal Necklace",
            "Strange Symbol",
            "Mind Stone",
            "Orshabaal's Brain",
            "Ice Rapier",
            "Two Handed Sword",
            "Giant Sword",
            "Silver Dagger",
            "Double Axe",
            "Fire Axe",
            "Golden Sickle",
            "Thunder Hammer",
            "Dragon Hammer",
            "Skull Staff",
            "Wand of Decay",
            "Necrotic Rod",
            "Snakebite Rod",
            "Devil Helmet",
            "Magic Plate Armor",
            "Golden Legs",
            "Boots of Haste",
            "Stone Skin Amulet",
            "Platinum Amulet",
            "Silver Amulet",
            "Demon Shield",
            "Mastermind Shield",
            "Crystal Ball",
            "Voodoo Doll",
            "Robe of the Underworld",
            "Ancient Amulet",
            "Onyx Arrow",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Prince_Drazzak",
        "name": "Prince Drazzak",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/0c/Prince_Drazzak.gif/revision/latest?cb=20220627140850&path-prefix=en",
        "attributes": {},
        "notes": "Five people are required to even enter his room in the first place. Apparently, there is a connection between Prince Drazzak and Variphor. You will receive the achievement Noblesse Obliterated after killing this boss.",
        "abilities": [
            "Melee (0-1500+)",
            "Death Beam (900-3000?)",
            "Death Wave (1000-3000?)",
            "Ultimate Explosion (3000-14000, only affects druids)",
            "Ultimate Explosion (3000-14000, only affects sorcerers)",
            "Ultimate Explosion (3000-5000, only affects paladins)",
            "Ultimate Explosion (smaller area) (3000-6000, only affects knights)",
            "Self-Healing (4000-4500)",
            "Teleports everyone in the room to him",
            "Summons (1-3 Demon )"
        ],
        "resistance": [
            "Physical 65%?",
            "Death 65%?",
            "Holy 65%",
            "Ice 65%",
            "Fire 65%",
            "Energy 65%",
            "Earth 65%?"
        ],
        "location": "Boss pit of Roshamuul Prison (here), a team of 5 players can enter his room with a Golden Prison Key (north switchplates, here).",
        "behaviour": "Druid taking 9760 Earth Damage while wearing 30% Earth Protection. Very erratic. At completely random times he will shout \"All <VOCATION>S must DIE!\" and 5 seconds after that he will cast a large AoE ability dealing massive damage to said vocation(s) and shouts DIE!. When he shouts \"GET OVER HERE!\", all players in the room are teleported next to him. His retargeting is also rather frequent.",
        "strategy": "Prince Drazzak All vocations should wear as much protection against Death Damage as possible (remember that many items can be imbued with Powerful Lich Shroud), followed by protection against the vocation's element (see abilities). The boss is resistant to damage, has a lot of hitpoints and heals a lot; prepare for a long battle (15-25 minutes). The most dangerous parts of the fight are the moments and Prince Drazzak teleports everyone to him, since he usually uses his Death spells immediately after that. Because of this, the whole team should be able to take and/or reduce about 6000 Death Damage. When the Demons spawn (they are not actually summons but regular Demons), quickly pass them to the blocker (but keep an eye on the UE warnings) and kill them, they can be quite a hassle if still alive when the boss teleports the team. Paladins, Sorcerers and Druids should bring the mana recovering dish and cupcake for emergencies, which can happen if the boss teleports the team twice in a short time. Knights: In order to safely block this boss, the should be able to take the Fire UE damage (level 450+ recommended). Even though it can hit quite a lot, with the proper protection it will be safer for the team as a whole if the Knight takes this damage and quickly heal afterwards, which shouldn't be very hard since the spell is announced beforehand. Paladins: The vocation with a greater chance of dying due to the high Death Damage from the boss teleport and the slow mana recovering. Wearing Energy Rings as well as Stone Skin Amulets (40 should be enough) are strongly recommended. Always keep an eye on your Ring duration and Amulet charges and replace them before they run out. When the Demons are summoned they will quickly use up the SSA charges, get rid of them as fast as possible to equip a new one. Mages: Might Rings will greatly reduce the damage taken, 20 should be more than enough for the fight (remember to replace them). Always keep the boss and the blocker on the limit of your game window to make sure you're outside the UE range, which is quite large. Druids should wear Earth Damage protection where Death protection isn't possible in case they take the damage. Bring at least 500 SDs and 500 UMPs - this fight takes a while.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Violet Crystal Shard",
            "Green Crystal Shard",
            "Blue Crystal Shard",
            "Cluster of Solace",
            "Unrealized Dream",
            "Demonic Essence",
            "Demon Horn",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Green Gem",
            "Giant Shimmering Pearl (Brown)",
            "Psychedelic Tapestry",
            "Dream Warden Mask",
            "Nightmare Hook",
            "Steel Boots",
            "Noble Axe",
            "Eye Pod",
            "Crystalline Armor",
            "Runed Sword",
            "Lightning Boots",
            "Lightning Robe",
            "Skull Helmet",
            "Nightmare Blade",
            "Spellbook of Dark Mysteries",
            "Executioner",
            "Nightmare Horn",
            "Dream Matter",
            "Crown Armor",
            "Demonwing Axe",
            "Abyss Hammer",
            "Demonbone Amulet",
            "Giant Shimmering Pearl",
            "Red Crystal Fragment",
            "Ring of Healing",
            "Green Crystal Fragment",
            "Demonic Tapestry",
            "Cyan Crystal Fragment",
            "Great Spirit Potion",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Terofar",
        "name": "Terofar",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/c/cc/Terofar.gif/revision/latest?cb=20220627140740&path-prefix=en",
        "attributes": {},
        "notes": "It is extremely difficult boss for paladins and knights due to his skill reducing abilities.",
        "abilities": [
            "Melee (0-1800)",
            "Curse (1-1000? Long cooldown,uses once per fight)",
            "Boulder (0-500)",
            "Blood Ball (0-?)",
            "Beam (Reduces Magic Level by 100%)",
            "Wave (Reduces Melee and Distance and Shielding )",
            "frequent Self-Healing (0-500)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 50%",
            "Holy 50%",
            "Ice 50%",
            "Fire 50%",
            "Energy 50%",
            "Earth 50%"
        ],
        "location": "Roshamuul Prison",
        "behaviour": "Attacks in melee range.",
        "strategy": "All vocations: Due to his strong abilities and melee it is advised to use prismatic rings along with Prismatic Necklace, Gill Necklace or Stone Skin Amulets.\nMages: Enter with Energy Ring and Stone Skin Amulet equipped. In the best case scenario, you will summon a monster that will reach Terofar before you do, so he's the one to be inflicted with a curse. If that doesn't work, you should keep an eye on the death hits you get and once it starts hitting over 300, you may want to put an Energy Ring again until the curse is gone. Keep Terofar on diagonal all the time, so you can avoid his waves, keep summoning Fire Devils in case they die, and just shoot it down with your Wand of Defiance/Glacial Rod and Sudden Death Runes. It will take around 10 minutes before it dies even if you are a high level.\nIt's also wise to carry few Mastermind Potions along and drink one of them each time you failed to react fast enough and got yourself hitted with Skill lowering wave.\nPaladins: You can start killing it pretty smooth around 400 level. Just stay on diagonal, keep on using Sharpshooter along with Great Spirit Potions and shoot it down with Infernal Bolts, Sudden Death Runes and occasional Strong Ethereal Spear. Remember to heal yourself to full before casting each Sharpshooter. It's also wise to carry Energy Ring and Pot of Blackjack/Rotworm Stew in case things go south and you can't overheal the damage you get.\nKnights: It's totally or at least nearly impossible to kill it as a Knight. Better ask your fellow friends with other vocation to do it for you.",
        "loot": [
            "Platinum Coin",
            "Small Amethyst",
            "Small Diamond",
            "Small Emerald",
            "Small Ruby",
            "Small Sapphire",
            "Small Topaz",
            "Blue Crystal Shard",
            "Violet Crystal Shard",
            "Green Crystal Shard",
            "Gold Ingot",
            "Cluster of Solace",
            "Demon Horn",
            "Great Spirit Potion",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Dream Warden Mask",
            "Blue Gem",
            "Green Gem",
            "Demonic Essence",
            "Giant Shimmering Pearl",
            "Guardian Shield",
            "Crown Shield",
            "Demon Shield",
            "Skull Helmet",
            "Royal Helmet",
            "Paladin Armor",
            "Terra Boots",
            "Steel Boots",
            "Boots of Haste",
            "Voltage Armor",
            "Earthborn Titan Armor",
            "Lavos Armor",
            "Unrealized Dream",
            "Dream Matter",
            "Magic Plate Armor",
            "Gold Coin",
            "Mastermind Shield",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Zavarash",
        "name": "Zavarash",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/a/a0/Zavarash.gif/revision/latest?cb=20220627140610&path-prefix=en",
        "attributes": {},
        "notes": "Seems to be weaker than other prison bosses.",
        "abilities": [
            "Melee (0-600)",
            "Massive Blood Explosion (0-300+)",
            "Heavy Magic Missile (0-350)",
            "Paralyze",
            "Berserk (0-400)",
            "Music Wave (0-?)",
            "Energy Beam (0-?)",
            "Self-Healing (400-600)",
            "Invisibility",
            "Summons (1-2 Dark Torturer )"
        ],
        "resistance": [
            "Physical 90%?",
            "Death 65%",
            "Holy 120%",
            "Ice 60%",
            "Fire 70%",
            "Energy 60%",
            "Earth 60%"
        ],
        "location": "Roshamuul Prison",
        "behaviour": "Unknown",
        "strategy": "Do not waste time on hitting his clone which is invulnerable to any kind of damage. Use an Energy Bomb Rune underneath you to avoid the Dark Torturers. Stay Diagonal to avoid beams and waves, and unless you are a Knight, stay out of his melee range as well. If you put any DOT (Damage over time)-effect on him (Inflict Wound from Knights, Soulfire or Ignite from Sorcerers, Envenom from Duids and Holy Flash from Paladins), he stops using his Invisibility.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Violet Crystal Shard",
            "Green Crystal Shard",
            "Blue Crystal Shard",
            "Demon Horn",
            "Demonic Essence",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Unrealized Dream",
            "Great Spirit Potion",
            "Cluster of Solace",
            "Giant Shimmering Pearl",
            "Gold Ingot",
            "Dream Warden Mask",
            "Crown Shield",
            "Blue Gem",
            "Guardian Halberd",
            "Green Gem",
            "Diamond Sceptre",
            "Guardian Shield",
            "Demon Shield",
            "Heavy Mace",
            "Onyx Flail",
            "Paladin Armor",
            "Mastermind Shield",
            "Demonbone",
            "Bonebreaker",
            "Lavos Armor",
            "Obsidian Truncheon",
            "Skullcracker Armor",
            "Loot Statistics"
        ]
    }
]