[
    {
        "url": "https://tibia.fandom.com/wiki/Blue_Djinn",
        "name": "Blue Djinn",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/8/82/Blue_Djinn.gif/revision/latest?cb=20240228100731&path-prefix=en",
        "attributes": {},
        "notes": "Although the Blue Djinns are considered entities of goodness they tend to guard their secrets well from nosy explorers, diligently performing any task they accepted. Being highly magical creatures, they are masters of illusion and transformation. Djinns are known for their witchcraft and fairy-tales commonly narrate about djinns granting people wishes. Magicians often mock this idea, arguing that only djinns bound by powerful magic feel obliged to such duties. Be that as it may, Blue Djinns are the weakest of their kind. Searching the world for the servants of evil and their eternal nemesis, the green djinns, they still pose a threat for all those they suspect of being in league with evil. These Magic Creatures are the counterpart of Green Djinn. Even though they are more amiable towards humans than the Green Djinn are, they will not tolerate anyone that aligns themselves with their greatest enemies.",
        "abilities": [
            "Melee (0-100)",
            "Fire strike (45-75) Blue Djinn",
            "Energy Strike (50-90) Blue Djinn",
            "life drain strike (55-105) Blue Djinn",
            "Drunkenness (30 seconds) Blue Djinn",
            "Cancels invisibility",
            "Shapeshifting (Turns victims into; rabbit ) Blue Djinn"
        ],
        "resistance": [
            "Physical 100%",
            "Death 113%",
            "Holy 80%",
            "Ice 110%",
            "Fire 20%",
            "Energy 50%",
            "Earth 100%"
        ],
        "location": "Kha'zeel, Magician Quarter, Forgotten Tomb.",
        "behaviour": "Blue Djinns use melee and use their fire attacks when the opponent tries to escape. They don't retarget.A blue djinn attacks in melee range.",
        "strategy": "If you can find a Dwarven Ring, wear it. When the Djinn makes you drunk, you sometimes don't have total control of your movements. It is very wise to wear this, as it can lower the chance of a trip back to the Temple. It is also good that you wear a Dragon Necklace to lower the damage inflicted by their fire attacks - In melee they use Fire Attack less frequently so try to close them fast.",
        "loot": [
            "Gold Coin",
            "Carrot",
            "Book (Blue)",
            "Small Sapphire",
            "Blue Piece of Cloth",
            "Royal Spear",
            "Dirty Turban",
            "Mana Potion",
            "Small Oil Lamp",
            "Blue Rose",
            "Mystic Turban",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Efreet",
        "name": "Efreet",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/de/Efreet.gif/revision/latest?cb=20240228100812&path-prefix=en",
        "attributes": {},
        "notes": "The Efreet are the merciless leaders of the green djinns. Surpassing their lesser brethren both in power and in cruelty, the Efreet are truly terrible opponents who love to use their awesome powers to spread havoc among their enemies or sometimes among their own kind. The disdain they feel towards all other sentient races is second only to the undying hatred they feel towards their blue-skinned relatives, the Marid. Efreets are a higher ranked Green Djinn and are the counterparts of Marids, these strong creatures are usually found in groups with Green Djinn.",
        "abilities": [
            "Melee (0-114)",
            "Fire strike (40-110) Efreet",
            "energy strike (65-115) Efreet",
            "life drain strike (60-120) Efreet",
            "paralyze (reduces 170-220 speed points for 15 seconds) Efreet",
            "Drunkenness (60 seconds) Efreet",
            "Electrifying berserk (25 hp/3 turns) Efreet",
            "Summons (1-2 Green Djinn )",
            "Self-Healing (50-80)",
            "Shapeshifting (Turns victims into; rat )"
        ],
        "resistance": [
            "Physical 100%",
            "Death 80%",
            "Holy 108%",
            "Ice 105%",
            "Fire 10%",
            "Energy 40%",
            "Earth 90%"
        ],
        "location": "Mal'ouquah, Deeper Banuta, Goromas Cult Cave (in the classroom), Magician Quarter, The Arcanum, Djinn Battle island through the Haunted Tomb.",
        "behaviour": "Efreets will make immense damage as they chase their opponents down with their two summons. They are usually not profitable for everyone.An efreet attacks in melee range. An efreet never retreats.",
        "strategy": "Do not approach Efreets at a low level. They are extremely dangerous and only susceptible to Ice and Holy Damage. Wearing a Dwarven Ring grants you the ability to move freely around the creature.\nDruids : Hunting Efreets can be a decent hunt (mostly for the Green Piece of Cloth that sells for 2-3k) for Druids, especially above level 80 since Strong Ice Strike was introduced. Beware when you face 2 or more, as you might drop very fast. Sudden Death runes is recommended to carry at all times if you'd be overrun.",
        "loot": [
            "Gold Coin",
            "Jewelled Belt",
            "Pear",
            "Royal Spear",
            "Small Emerald",
            "Strong Mana Potion",
            "Green Piece of Cloth",
            "Green Tapestry",
            "Heavy Machete",
            "Wand of Inferno",
            "Noble Turban",
            "Magma Monocle",
            "Mystic Turban",
            "Small Oil Lamp",
            "Green Gem",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Green_Djinn",
        "name": "Green Djinn",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/e2/Green_Djinn.gif/revision/latest?cb=20240228100412&path-prefix=en",
        "attributes": {},
        "notes": "In ancient times the Green Djinns lost a great war against their blue brethren. Considered to be extinct, the last knowledge of these powerful beings turned into legends and legends became fairy-tales. Those who have encountered the recently resurfaced, self-proclaimed masters of evil can attest that they are indeed, a reality, and not a pleasant one. These magic-wielding enemies of all good embrace destruction and enjoy causing pain. Although only inferior members of the green-skinned race have been sighted until now, they are enemies to beware of.  Their magical tricks make them more than a match for unexpecting adventurers. Despising all living beings and everything that is beautiful, their especially passionate hatred is reserved for their blue-skinned relatives, whom they regard as traitors to djinnkind. These Magic Creatures are the counterpart of Blue Djinn and a lower rank than Efreet. They can turn you into a rat and cancel your invisibility. You can receive a task to kill 500 green djinns of the Killing in the Name of... Quest. When you complete this task you may fight Merikh the Slaughterer.",
        "abilities": [
            "Melee (0-110)",
            "fire strike (45-75) Green Djinn",
            "energy strike (50-90) Green Djinn",
            "life drain strike (55-105) Green Djinn",
            "Drunkenness (30 seconds) Green Djinn",
            "Cancel Invisibility",
            "Shapeshifting (Turns victims into; rat )"
        ],
        "resistance": [
            "Physical 80%",
            "Death 80%",
            "Holy 113%",
            "Ice 110%",
            "Fire 20%",
            "Energy 50%",
            "Earth 100%"
        ],
        "location": "Mal'ouquah, Oasis Tomb, under the Ankrahmun Library Tomb, Serpentine Tower last floor behind the Magic Walls, Deeper Banuta, Goroma underground, Magician Quarter.",
        "behaviour": "Green Djinns use strong melee when close to their opponents, and Energy Attacks when the opponent is at a distance.A green djinn attacks in melee range. A green djinn never retreats.",
        "strategy": "It is highly recommended to wear a Dwarven Ring as it can save you a trip back to the Temple! When Djinns make you drunk, it is very hard to control your movements. They can make you very drunk. A useful way for a sorcerer or druid to kill one is to summon a Demon Skeleton and to use that to attack and block the djinn and also use Ice Strike to kill it faster, this is a useful technique as the Demon Skeleton would not take much damage aside from electrical attacks, so you may need to summon another one every 5-6 djinns. At about level 60 a druid can easily and quickly kill these using just their Hailstorm Rod and Ice Strike.\nAnother option is running and shooting with Avalanche Rune.",
        "loot": [
            "Gold Coin",
            "Cheese",
            "Book (Green)",
            "Small Emerald",
            "Green Piece of Cloth",
            "Royal Spear",
            "Dirty Turban",
            "Small Oil Lamp",
            "Grave Flower",
            "Mana Potion",
            "Mystic Turban",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Marid",
        "name": "Marid",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/a/a1/Marid.gif/revision/latest?cb=20050601213801&path-prefix=en",
        "attributes": {},
        "notes": "The proud Marid are the strongest warriors among the noble race of the blue djinn. They possess amazing magical powers, and their prowess in battle is truly fearsome. However, their undeniable power as well as their race's natural tendency towards pride make them vulnerable to the temptations of vanity and arrogance. The Marid, being devout followers of the prophet Daraman's teachings, try to resist these temptations as well as they can, but it has happened before that a Marid strayed from the true path and succumbed to the corruption and the lowly desires that are hidden deep in the soul of every djinn. Beware of such fallen Marid, because they are no better than the Efreet, the Marids' green-skinned djinn cousins and arch-enemies. These strong creatures are usually found in groups and with many Blue Djinn. In the Blue Djinn Fortress, they are also accompanied by Scarabs and Fire Elementals.",
        "abilities": [
            "Melee (0-114)",
            "Life drain Strike (60-120) Marid",
            "Fire Strike (40-110) Marid",
            "Energy Strike (65-115) Marid",
            "Drunkenness (60 seconds) Marid",
            "Electrifies (25 hp/3 turns) Marid",
            "paralyze (reduces 170-220 speed points for 15 seconds) Marid",
            "Summons (1-2 Blue Djinn )",
            "Self-Healing (50-80) Marid",
            "Shapeshifting (Turns victims into; rabbit )"
        ],
        "resistance": [
            "Physical 100%",
            "Death 108%",
            "Holy 80%",
            "Ice 105%",
            "Fire 10%",
            "Energy 40%",
            "Earth 90%"
        ],
        "location": "Kha'zeel, Magician Quarter, Djinn battle island through the Haunted Tomb.",
        "behaviour": "Marid seems to be a Higher Ranked Blue Djinn.A marid attacks in melee range.",
        "strategy": "Wear a Dwarven Ring at all times when facing these. If hunting in the Ashta'daramai, bring a good blocker and a druid that can use Eternal Winter. Because of the large number of creatures in the small rooms of the Blue Djinn Fortress (and that they all have strong distance attacks), you can lose up to 800 or more hitpoints just from \"peeking\" up the steps. Even though this creature only yields 410 experience points, they can be as deadly as a Dragon Lord.",
        "loot": [
            "Gold Coin",
            "Blueberry",
            "Jewelled Belt",
            "Royal Spear",
            "Small Sapphire",
            "Strong Mana Potion",
            "Blue Piece of Cloth",
            "Blue Tapestry",
            "Heavy Machete",
            "Seeds",
            "Hailstorm Rod",
            "Noble Turban",
            "Magma Monocle",
            "Blue Gem",
            "Mystic Turban",
            "Small Oil Lamp",
            "Wooden Flute",
            "Loot Statistics"
        ]
    }
]