[
    {
        "url": "https://tibia.fandom.com/wiki/Animated_Guzzlemaw",
        "name": "Animated Guzzlemaw",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/4/48/Animated_Guzzlemaw.gif/revision/latest?cb=20210420174146&path-prefix=en",
        "attributes": {},
        "notes": "It's very similar to a Guzzlemaw.",
        "abilities": [
            "Melee (0-450+)",
            "Earth Explosion on target (0-200; causes bleeding starting from up to 35 hp per turn)",
            "Explosion Life Drain Wave (650-800+)",
            "Self-Healing (0-400+)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Museum of Tibian Arts",
        "behaviour": "An animated guzzlemaw attacks in melee range. An animated guzzlemaw never retreats.",
        "strategy": "Stay diagonal at all times to avoid its wave. If you don't have at least 1000 HP, it's recommended not to block this creature. Mages under level 200 should use Magic Shield.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Brown Crystal Splinter",
            "Great Mana Potion",
            "Fish Tail",
            "Fishbone",
            "Frazzle Skin",
            "Skull (Item)",
            "Haunted Blade",
            "Ham",
            "Frazzle Tongue",
            "Fish",
            "Remains of a Fish",
            "Bone",
            "Violet Crystal Shard",
            "Red Crystal Fragment",
            "Great Health Potion",
            "Hardened Bone",
            "Piece of Iron",
            "Banana Skin",
            "Crystal Rubbish",
            "Big Bone",
            "Iron Ore",
            "Fish Fin",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Bad_Dream",
        "name": "Bad Dream",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/f/f4/Bad_Dream.gif/revision/latest?cb=20141205115140&path-prefix=en",
        "attributes": {},
        "notes": "Its only purpose is to be soothed as part of the Roshamuul Quest.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 0%",
            "Death 0%",
            "Holy 0%",
            "Ice 0%",
            "Fire 0%",
            "Energy 0%",
            "Earth 0%"
        ],
        "location": "Roshamuul Junkyard.",
        "behaviour": "Does nothing; stands by waiting to be soothed.",
        "strategy": "No strategy viable, during the Roshamuul Quest they will be removed temporarily.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Choking_Fear",
        "name": "Choking Fear",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/c/ce/Choking_Fear.gif/revision/latest?cb=20210420140910&path-prefix=en",
        "attributes": {},
        "notes": "Like a giant, gaunt goblin, cunning and swift-footed with slender, long arms that are fearfully strong, the Choking Fear searches for anything to throttle. It has no head, but loves to twist heads off. A Choking Fear will always chase after opponents, trying to get close, eager to have his long cold fingers around their necks. It enjoys the sound and feel of the dying and delights in feeling their death rattle. It is surmised that somewhere, in a dark prison cell, horrible pains and fears had been inflicted to the father of all Choking Fears, maddening him beyond belief until his rage took a ghastly form and he escaped. Any Choking Fear will always see all that breathes as its enemy, and chase them relentlessly while taunting them about their nearing end. Choking Fears love to tease and toy with their victims, prolonging their death; and they tie up their victims in their hemp ropes as a ghastly dangling trophy attached to high trees or roof beams.",
        "abilities": [
            "Melee (0-500)",
            "Death bomb (250-500)",
            "Poison wave (Poisons you starting from up to 45 hp per turn)",
            "Mana Drain sleeping bomb (25-100)",
            "life drain sleeping strike (400-500)",
            "large bubble explosion ( drowns you for 50+ turns)",
            "Paralyze",
            "very slow Self-Healing (80-150)"
        ],
        "resistance": [
            "Physical 90%",
            "Death 45%",
            "Holy 100%",
            "Ice 90%",
            "Fire 0%",
            "Energy 98%",
            "Earth 0%"
        ],
        "location": "All over the surface of Upper Roshamuul and Nightmare Isles.",
        "behaviour": "Chases the enemy and fights in close-combat. Rarely retargets.A choking fear attacks in melee range. A choking fear never retreats.",
        "strategy": "A rather annoying enemy, especially with their frequent partners, the Retching Horrors. Lower level and solo players may take advantage of their reluctance to run over Energy Fields, and lure them into a relatively empty area where you're less likely to get swarmed. Recommended for all vocations to use garlic necklace and protection from death attacks.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Brown Crystal Splinter",
            "Great Spirit Potion",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Dead Weight",
            "Hemp Rope",
            "Blue Crystal Splinter",
            "Brown Piece of Cloth",
            "Life Ring",
            "Beastslayer Axe",
            "Yellow Piece of Cloth",
            "Energy Ring",
            "Ring of Healing",
            "Guardian Shield",
            "Green Crystal Shard",
            "Shadow Sceptre",
            "Red Piece of Cloth",
            "Spellbook of Mind Control",
            "Sai",
            "Terra Boots",
            "Underworld Rod",
            "Springsprout Rod",
            "Cluster of Solace",
            "Terra Mantle",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Demon_Outcast",
        "name": "Demon Outcast",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/2/22/Demon_Outcast.gif/revision/latest?cb=20131126125425&path-prefix=en",
        "attributes": {},
        "notes": "Demon outcasts are demons who have somehow fallen out of grace with their superiors. In demon society, this might happen for any reason and usually, punishment is swift and final. Sometimes though, annihilation may be considered too swift or too much of a waste. Outcasts are branded for eternity, and even if they manage to serve their way back into the ranks of the demons, they are still considered inferior and disgusting - if only because they remind other demons of how quickly anyone may fall. The treatment of outcasts varies with the whims of the local demonic rulers; some outcasts might serve as gladiators for entertainment, others are used as subjects for various tortures and experiments.  Only in rare cases do demons bother to keep outcasts as prisoners; usually if they are supposed to be in possession of valuable information or particularly useful powers. The life of an outcast is miserable at best, and either way a constant fight for survival. The continuous hardships permit only the most cunning and resilient of them to survive, and their natural aggressiveness is magnified to an extreme extent. Outcasts are prone to going berserk, and even if they should somehow have gained their freedom, not much in their behaviour changes.  Outcasts usually don't think in long terms. Surviving the next day and venting off their immense anger is everything that matters to them. Their only delight seems to be to destroy and inflict pain and suffering to others. Sometimes, that attitude has induced demonic leaders to use them as expendable shock troops or to unleash them in an area that should simply be devastated and made uninhabitable. Once loose, they usually feel nothing but contempt for other demons and are unlikely to follow orders from anyone but the strongest and most frightening demons. As there is no common ground for outcasts even with their own kind, they only \"join forces\" for some random destructive acts. If there is nothing else to destroy or kill, outcasts will soon attack each other, and therefore no organised outcast societies are known. Only recently, escapees of a demonic prison joined the ranks of the known outcasts. They once belonged to the entourage of powerful demon princes, and might actively act to free them or regain the attention of a demon prince. Whether this is only a temporary switch to older routines or a more pervasive cast of mind remains yet to be seen.",
        "abilities": [
            "Melee (0-400)",
            "Energy Beam (0-450) Demon Outcast",
            "Life Drain Beam (0-400) Demon Outcast",
            "Mana Drain Ball (Only affects Mages inside the range) (55-150) Demon Outcast",
            "Debuff (Reduces Distance by 75%~) Demon Outcast",
            "Self-Healing (?)",
            "Summons (1-2 Energy Elemental )"
        ],
        "resistance": [
            "Physical 85%",
            "Death 70%",
            "Holy 106%",
            "Ice 95%",
            "Fire 0%",
            "Energy 108%",
            "Earth 60%"
        ],
        "location": "Roshamuul Prison.",
        "behaviour": "A demon outcast attacks in melee range. A demon outcast never retreats.",
        "strategy": "These are the most common creatures inside the Roshamuul Prison, so special attention must be paid at them. Their summons are more annoying than dangerous. When hunting in teams, the blockers should throw a Poison Bomb Rune under their feet in order to avoid the Energy Elementals from getting close and taking the spot of other stronger creatures. When facing them solo, low level paladins can run around energy walls. Mages should shall use their strongest ice and energy attacks to take down this creature. Their mana drain is an area attack on target of the size of the Berserk spell, but it will only drain mana from Mages.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Fire Mushroom",
            "Ultimate Health Potion",
            "Great Mana Potion",
            "Small Diamond",
            "Small Ruby",
            "Small Sapphire",
            "Small Topaz",
            "Small Emerald",
            "Assassin Star",
            "Ring of Healing",
            "Giant Sword",
            "Stealth Ring",
            "Crown Shield",
            "Might Ring",
            "Ice Rapier",
            "Platinum Amulet",
            "Crusader Helmet",
            "Devil Helmet",
            "Demon Dust",
            "Cluster of Solace",
            "Demon Shield",
            "Crown Armor",
            "Demonrage Sword",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Enfeebled_Silencer",
        "name": "Enfeebled Silencer",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/9e/Enfeebled_Silencer.gif/revision/latest?cb=20170709121447&path-prefix=en",
        "attributes": {},
        "notes": "The Enfeebled Silencer is a weaker version of Silencers. It's a weaker version of a Silencer.\nYou need to kill 200 Enfeebled Silencers and Weakened Frazzlemaws as part of the Threatened Dreams Quest.",
        "abilities": [
            "Melee (0-150 and starting up to 10 hp/turn)",
            "Thunderstorm missile (0-150)",
            "Mana Drain (0-75)",
            "Self-Healing (0-200)",
            "Strong Haste"
        ],
        "resistance": [
            "Physical 95%",
            "Death 35%",
            "Holy 125%",
            "Ice 85%",
            "Fire 70%",
            "Energy 85%",
            "Earth 40%"
        ],
        "location": "Feyrist - Cave here and Mountains here",
        "behaviour": "An enfeebled silencer attacks in melee range. An enfeebled silencer never retreats.",
        "strategy": "Their Haste makes them almost impossible to run away from, so  wear energy protection and try to take them out quickly so that you wont get trapped.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Fairy Wings",
            "Assassin Star",
            "Silencer Claws",
            "Haunted Blade",
            "Stealth Ring",
            "Glorious Axe",
            "Shadow Sceptre",
            "Terra Boots",
            "Terra Legs",
            "Diamond Sceptre",
            "Boots of Haste",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Feversleep",
        "name": "Feversleep",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/70/Feversleep.gif/revision/latest?cb=20131129181708&path-prefix=en",
        "attributes": {},
        "notes": "Some of the inquisition reports are the sole information source there currently is concerning the feversleeps. From their brief glimpses of it, the inquisitors surmise a feversleep may be an adolescent form of a terrorsleep, or maybe the decrepit, old age stage at the end of a terrorsleep's days. The only thing that can be said with some certainty is that feversleeps are somehow related to the terrorsleeps, in whose company they are often seen.Feversleeps emit a strange, sweaty heat. When victims draw near, feversleeps often cloak themselves in shadow, becoming invisible, detectable only by their foul stench and a strange weakening effect they have on their prey, distorting their prey's sense of time and draining its powers so they can feed on it.Feversleeps love cool water, and are often seen next to pools or rivers, preferably underground in a dark and dank cavern. They have been seen mainly in Upper Roshamuul and are maybe attracted to ruins of ancients settlements, or may have had another purpose when the ruins were still inhabited. However, no one so far ever ventured to investigate closer, as the feversleeps are a promise of a slow, horrible end in the throes of deathly hallucinations, for all that stay too long in their vicinity. They exist primarily underground, although they may occasionally appear in large groups as a raid on the north-eastern part of Upper Roshamuul.",
        "abilities": [
            "Melee (0-400?)",
            "yellow poison bomb UE (?)",
            "Sudden Death (Reduces Melee by 55-60%)",
            "Self-Healing (250?-550)"
        ],
        "resistance": [
            "Physical 85%",
            "Death 45%",
            "Holy 110%",
            "Ice 95%",
            "Fire 65%",
            "Energy 105%",
            "Earth 0%"
        ],
        "location": "Roshamuul Mines (down here), Roshamuul Cistern (down here).",
        "behaviour": "A feversleep attacks in melee range.",
        "strategy": "Compared to the monsters on the Upper Roshamuul surface, feversleep are not a big threat. However, they often appear in large groups and with Terrorsleep. Beware their melee skill reduction because their high health, healing abilities and your low skills will drag the fight on for a long time.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Great Mana Potion",
            "Cyan Crystal Fragment",
            "Small Topaz",
            "Small Emerald",
            "Trapped Bad Dream Monster",
            "Small Ruby",
            "Ultimate Health Potion",
            "Bowl of Terror Sweat",
            "Small Amethyst",
            "Blue Crystal Shard",
            "Blue Crystal Splinter",
            "Blue Robe",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Frazzlemaw",
        "name": "Frazzlemaw",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/53/Frazzlemaw.gif/revision/latest?cb=20131126123308&path-prefix=en",
        "attributes": {},
        "notes": "Frazzlemaws are fast, fierce and above all - biting creatures. Once scented, it is not easy for a human being to escape them. Basically a ball of teeth, they have neither eyes nor ears, they are simply upon this world to feast. Their arch rivals are the equally fast and ferocious silencers. They usually avoid each other as both have strengths and weaknesses which would outmaneuvre one against the other. They share some kind of strange religion with their larger siblings, the guzzlemaws.",
        "abilities": [
            "Melee (0-450+)",
            "Explosion Beam (350-600) Frazzlemaw",
            "Blood Berserk (0-500+) Frazzlemaw",
            "Bleeding Stone Explosion Frazzlemaw",
            "Paralyze Red Shimmer Ball (reducing about 40-80% of your base speed) Frazzlemaw",
            "Frazzle Burp (unknown maybe buff) Frazzlemaw",
            "Self-Healing (250-425+?)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 90%",
            "Holy 105%",
            "Ice 95%",
            "Fire 90%",
            "Energy 85%",
            "Earth 80%"
        ],
        "location": "Lower Roshamuul, Guzzlemaw Valley, the entrance to Upper Roshamuul.",
        "behaviour": "Chases its target and fights in close combat. A Frazzlemaw will walk over all fields to reach its target.A frazzlemaw attacks in melee range. A frazzlemaw never retreats.",
        "strategy": "All Vocations: Stay diagonal at all times to avoid the beam because it hits very hard. If you can't, consider wearing a Garlic Necklace or Necklace of the Deep to reduce damage. Avoid fighting more than one at time, and absolutely avoid three or more, because their damage really adds up.Knights: Lower level knights may want to use Brutal Strike, Berserk, Front Sweep, etc. to kill them faster (although this won't be profitable). Another strategy would be to place an energy wall on the ground and make the Frazzlemaw run back and forth over it to deal extra damage. Higher level knights can simply attack and heal, although they can still throw in some spells to speed up the killing. Paladins: Avoid running too much because you will likely get swarmed. Assassin Stars are better than a bow or crossbow here because of their high melee. These monsters can be very profitable for paladins. Druids and Sorcerers: Avoid soloing these monsters. They hit high and are hard to run from, as well as being resistant to most magic. They are also found in the presence of Silencers, which will lower Magic Level and do strong Mana Drain attacks. Using a blocker to hunt these is the best idea.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Great Mana Potion",
            "Great Health Potion",
            "Frazzle Skin",
            "Frazzle Tongue",
            "Brown Crystal Splinter",
            "Skull (Item)",
            "Fish Tail",
            "Banana Skin",
            "Piece of Iron",
            "Fishbone",
            "Remains of a Fish",
            "Bone",
            "Crystal Rubbish",
            "Fish",
            "Red Crystal Fragment",
            "Ham",
            "Big Bone",
            "Fish Fin",
            "Hardened Bone",
            "Violet Crystal Shard",
            "Iron Ore",
            "Haunted Blade",
            "Two Handed Sword",
            "Gold Ingot",
            "Sai",
            "Nightmare Blade",
            "Assassin Dagger",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Guilt",
        "name": "Guilt",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/df/Guilt.gif/revision/latest?cb=20210420180952&path-prefix=en",
        "attributes": {},
        "notes": "Apppears in the Ferumbras' Ascension Quest with Tarbaz.",
        "abilities": [
            "Missile (200-500)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Ferumbras' Ascension Quest quest area.",
        "behaviour": "Unknown.",
        "strategy": "Unknown.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Guzzlemaw",
        "name": "Guzzlemaw",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/72/Guzzlemaw.gif/revision/latest?cb=20210420140852&path-prefix=en",
        "attributes": {},
        "notes": "The guzzlemaw is a larger variation of the frazzlemaw. Not only will they bite even heftier, they can actually swallow a person up in one nibble. They almost know no fear and seem to follow strange patterns and routines. Somehow these big maws have erected shrines for a probably non-existent god they worship as the \"Overmaw\". It is better to make short work of them as they are often surrounded by a pack of smaller guzzlemaws and wouldn't hesitate to call even more of them to join their fray.",
        "abilities": [
            "Melee (0-550+)",
            "Bleeding Stone Explosion (starting from up to 35 hp per turn)",
            "Large Red Shimmer Ball ( Paralyzes you)",
            "Explosion Wave (650-800+) Guzzlemaw",
            "Blood Berserk (400-500+) Guzzlemaw",
            "Self-Healing (0-400+)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 90%",
            "Holy 105%",
            "Ice 95%",
            "Fire 90%",
            "Energy 85%",
            "Earth 80%"
        ],
        "location": "Guzzlemaw Valley, and a single spawn in a tower in Upper Roshamuul (south of the Depot and west of the entrance to Roshamuul Prison).",
        "behaviour": "Follows you until death.A guzzlemaw attacks in melee range. A guzzlemaw never retreats.",
        "strategy": "Stay diagonal, this wave hits high. If you can't, consider wearing a Garlic Necklace or Necklace of the Deep to reduce damage. When faced together with the lesser monsters, make sure to take the big guys out first. Most of their attacks are through physical damage.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Great Health Potion",
            "Brown Crystal Splinter",
            "Great Mana Potion",
            "Frazzle Tongue",
            "Crystal Rubbish",
            "Remains of a Fish",
            "Ham",
            "Fish Tail",
            "Piece of Iron",
            "Red Crystal Fragment",
            "Banana Skin",
            "Bone",
            "Frazzle Skin",
            "Skull (Item)",
            "Fishbone",
            "Fish",
            "Fish Fin",
            "Hardened Bone",
            "Iron Ore",
            "Violet Crystal Shard",
            "Big Bone",
            "Two Handed Sword",
            "Haunted Blade",
            "Sai",
            "Nightmare Blade",
            "Assassin Dagger",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Memory_of_a_Frazzlemaw",
        "name": "Memory of a Frazzlemaw",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/53/Memory_of_a_Frazzlemaw.gif/revision/latest?cb=20220108225036&path-prefix=en",
        "attributes": {},
        "notes": "It's a weakened Frazzlemaw.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Time Travel Dungeon",
        "behaviour": "A memory of a frazzlemaw attacks in melee range.",
        "loot": [
            "Piece of Iron",
            "Big Bone",
            "Brown Crystal Splinter",
            "Cluster of Solace",
            "Gold Ingot",
            "Great Mana Potion",
            "Red Crystal Fragment",
            "Crystal Rubbish",
            "Great Health Potion",
            "Bottle of Champagne",
            "Gold Coin",
            "Ham",
            "Fish Tail",
            "Banana Skin",
            "Fishbone",
            "Fish",
            "Bone",
            "Violet Crystal Shard",
            "Special Fx Box",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minion_of_Gaz%27haragoth",
        "name": "Minion of Gaz'haragoth",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/39/Minion_of_Gaz%27haragoth.gif/revision/latest?cb=20131130171328&path-prefix=en",
        "attributes": {},
        "notes": "Looks the same as a Demon Outcast. They are spawned by Gaz'haragoth but they act as independent monsters. When slain, they turn into Strange Vortexes which lead to the Nightmare of Gaz'haragoth.",
        "abilities": [
            "Melee (0-700)",
            "Energy Beam (275-625) Minion of Gaz'haragoth",
            "Death Spit (400) Minion of Gaz'haragoth"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 80%",
            "Fire 200%",
            "Energy 80%",
            "Earth 100%?"
        ],
        "location": "Spawned by Gaz'haragoth in his arena.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Nightmare_Scion",
        "name": "Nightmare Scion",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/90/Nightmare_Scion.gif/revision/latest?cb=20081212000310&path-prefix=en",
        "attributes": {},
        "notes": "It is highly unlikely that the so-called Nightmare Scion is actually the offspring of a nightmare. Some people say that the Nightmare Scions are a completely different breed than the nightmares, others claim that they are the same breed, only weaker due to injuries or some sort of demonic disease. A common theory states that the Nightmare Scions are the prototype of the actual nightmare. Just like this theory, also another one assumes that nightmares do not breed, but that all nightmares come into existence through the same process. Those creatures that do not possess  the full amount of power turn into Nightmare Scions. It is not known, yet if Nightmare Scions can become true nightmares by ageing or maybe by accumulating power in some way. They are usually found in the company of nightmares and seem to get along with each other quite well for demonic races.What a Nightmare Scion lacks in raw power, it tries to make up with wickedness. They are exceptionally cruel and love to prey on weaker foes. In general, they occur in great numbers to be safe. This seems not only to combine their power but also their wickedness. Nightmare Scions love to stalk their victims in the shadow for hours. Making sure they get noticed by their prey, they seem to feed on the fear they arouse. After some while, the Nightmare Scions will begin to slowly attack their victims until the whole force will swarm around the prey. Victims of Nightmare Scions can be easily recognised by the fear frozen into their dead faces. Added in the Christmas Update 2008.",
        "abilities": [
            "Melee (0-140)",
            "Earth Ball (115-180) Nightmare Scion",
            "Death Hit (70-130) Nightmare Scion",
            "Self-Healing (60-95) Nightmare Scion",
            "Paralyze"
        ],
        "resistance": [
            "Physical 100%",
            "Death 0%",
            "Holy 125%",
            "Ice 90%",
            "Fire 80%",
            "Energy 80%",
            "Earth 0%"
        ],
        "location": "Cemetery Quarter, Alchemist Quarter and in the Arena and Zoo Quarter (unreachable), Vengoth Castle, Formorgar Mines, Lower Spike, Robson Isle (single respawn), Krailos Ruins.",
        "behaviour": "Runs in low health.A nightmare scion attacks in melee range.",
        "strategy": "Just like every other creature that runs in low health, try to cast a strong spell or rune to prevent it from running too far, and try not to lure any other creatures. And also know that Nightmare Scions are really fast, so it's best to finish them off quickly or trap in a place where they can't run away.",
        "loot": [
            "Gold Coin",
            "Meat",
            "Essence of a Bad Dream",
            "Scythe Leg",
            "Platinum Coin",
            "Crown Helmet",
            "Bar of Chocolate",
            "Crystal of Focus",
            "Death Ring",
            "Diamond Sceptre",
            "Focus Cape",
            "Shadow Sceptre",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Nightmare_of_Gaz%27haragoth",
        "name": "Nightmare of Gaz'haragoth",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/4/46/Nightmare_of_Gaz%27haragoth.gif/revision/latest?cb=20131208025358&path-prefix=en",
        "attributes": {},
        "notes": "Looks the same as a Terrorsleep. You will find them by stepping in a Strange Vortex, created when Gaz'haragoth's minions are slain.",
        "abilities": [
            "Melee (0-300+)",
            "Life Drain Distance Attack (500-800)",
            "Some kind of beam (500-1000)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 200%",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Gaz'haragoth's Nightmare, here.",
        "behaviour": "Unknown.",
        "strategy": "Ignore them and run to the portal in the south-east. These creatures have instant respawn, after you killed them, they spawn again in a moment, so they should be avoided at any cost.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Nightmare",
        "name": "Nightmare",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/e9/Nightmare.gif/revision/latest?cb=20061212200344&path-prefix=en",
        "attributes": {},
        "notes": "One thing that always eludes the demons and their powers are dreams. The gift of dreaming is only granted to mortals. Still some demons lurk at the borders of dreams, watching, drooling with hatred and greed. Sometimes a dreamer gets some distant feeling of those unwelcome spectators. Such dreams often turn into nightmares. The chaos and fear, that  is caused by nightmares, allow the lurking demons to steal some of the essence of these dreams. By eating more and more of this substance, demons gain certain characteristics which are normally not at disposal of demons. To some extent they are even able to haunt the dreams of the mortals, although their influence is only indirect and limited. Their physical form reflects their constant travel to a place they do not belong to and takes the shape of a ghostly horse creature. Their powers in the lands of the living are somewhat more substantial and often involve to weaken mortals and to steal their life force. Creature added in the Christmas 2006 update. Often hunted for Death Rings and Demonic Essences, since it's one of weakest monsters that can provide such items. It is good to take caution while hunting these creatures, as they can combo hard and do so unexpectedly.",
        "abilities": [
            "Melee (0-150)",
            "Death Strike (120-170) Nightmare",
            "Poison Ball (150-500) Nightmare",
            "Self-Healing (60-100) Nightmare",
            "Paralyze",
            "Haste"
        ],
        "resistance": [
            "Physical 100%",
            "Death 0%",
            "Holy 125%",
            "Ice 90%",
            "Fire 80%",
            "Energy 80%",
            "Earth 0%"
        ],
        "location": "Pits of Inferno, Formorgar Mines, Cemetery Quarter, Edron (In multiple places during The Inquisition Quest), Alchemist Quarter, Vengoth Castle, Deeper Banuta (small spawn, here), Krailos Ruins and Grounds of Deceit.",
        "behaviour": "Runs away at deep red, often using haste then.A nightmare attacks in melee range.",
        "strategy": "Don't try to outrun them, Nightmares are pretty fast, resembling the speed of a Level 110.  Their Poisonball attack is very strong, and can easily lead to death if you are not paying attention. Try to kill them in such a way that they will trap themselves when they begin to run. They run away when they have less than 300 hp. If you are a mid-to-high level vocation (especially paladins and mages) and you are hunting them at the Cemetery Quarter avoid getting multiple Nightmare Scions while killing a Nightmare as they can combo very hard. If you're blocking a Nightmare and one Nightmare Scion, try to kill the scion first. But, if the Nightmare is in red hp try to kill him fast. It is a good idea to bring a Terra Amulet since it will block 20% of all Earth Damage and will not wear off fast because nightmares do not poison you with their attacks. Knights: Killing Nightmares as a knight has 2 good strategies.\nThe first and easiest way to kill Nightmares is having 2 or more knights of Level 80 or more simply lure it, then trap it and hit it until it dies.\nThe second way can require a bit more experience, having one knight of Level 85 or more and a Druid of Level 50 or more to Sio you. Simply lure the Nightmare, try to trap it, and kill while a druid is healing you. Keep in mind that the Nightmare can rarely hit you for 700 damage in a nasty combo, so it is not a bad idea to bring some potions for the blocker and UHs for the mages to use on the knight. At about Level 95, knights can solo Nightmares with ease. Note: Knights, DO NOT HAVE CHASE OPPONENT ON! YOU CANNOT HEAL ALL THE TIME! If you have chase opponent on you are more likely to run into more creatures and get combo'd. If you are soloing these, try to combo your last attack with a Fierce Berserk, so they don't have time to run away. Also Nightmares have extremely low defense, Exori attacks are very strong. Their melee is very weak (comparable to a Mutated Rat or a Dragon) and they don't have any wave so diagonal isn't necessary. Paladins: Level 80 recommended. Exura San at 700-800 hp don't let your hp go lower than 700. Royal Spears, Enchanted Spears or Assassin Stars are all that is needed besides 80 distance and 1 to 10 Strong Mana Potion per Nightmare and some Strong Health Potions for emergencies. Mages: Mages of Level 70+ can solo Nightmares with only Ice Strike for sorcerers and Physical Strike for druids, rod or wand and Utamo Vita. Levels 130+ can kill with just exura and using Terra Set. Sorcerers also have the option of the Robe of the Underworld to protect against Death Damage which is especially helpful if you are hunting in the Cemetery Quarter and are killing the Grim Reapers as well. When it begins to run away at low health, you can use various runes or waves to bring it down (any with non-death damage).",
        "loot": [
            "Gold Coin",
            "Ham",
            "Soul Orb",
            "Flask of Demonic Blood",
            "Essence of a Bad Dream",
            "Demonic Essence",
            "Scythe Leg",
            "Platinum Coin",
            "Death Ring",
            "Power Bolt",
            "Ancient Shield",
            "Knight Legs",
            "Skeleton Decoration",
            "Boots of Haste",
            "War Axe",
            "Mysterious Voodoo Skull",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Nightstalker",
        "name": "Nightstalker",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/8/81/Nightstalker.gif/revision/latest?cb=20240228102044&path-prefix=en",
        "attributes": {},
        "notes": "Nightstalkers have haunted the dreams and stories of children since the dawn of mankind and  probably even before that. Like some other demonic creatures, they seem to feed, at least partially, on the fear of their victims. Divination magic revealed that they are no native denizens of our realm, however, the question where Nightstalkers actually come from is still unanswered. They are cunning and intelligent creatures that are even able to talk our language. They prefer lairs in dark and abandoned places like ruins and caves. Sometimes, Nightstalkers form small colonies, but most of them are notorious loners.Sages speculate that the Nightstalkers' wish for loneliness results from their life cycle. At certain stages in their life, they leave the company of their kin to become lonely prowlers that secretly stalk the settlements of civilised creatures to haunt particularly their children. During these stages, Nightstalkers seem to dematerialise, almost like ghosts. They feed on the fears of those around them and adopt features derived from these subconscious fears. Luckily, Nightstalkers also gain a certain vulnerability in this state. After some while, Nightstalkers gradually retransform to their original state. Once they have reached it, they seem to hibernate for a while, which surely explains why they  tend to leave civilised places in advance of the transformation. Thereafter, they live for a longer period in their natural state in which they might be encountered at remote places. During this phase, they do not actively prey on creatures but are more than ready to rip anyone in pieces who gets close to their lairs.",
        "abilities": [
            "Melee (0-90 and starting up to 4 hp/turn)",
            "Holy Life Drain (60-170)",
            "Invisible",
            "Haste",
            "Paralyze (sleep effect)",
            "Self-Healing (70-130)",
            "Creature Illusion ( Werewolf , Vampire Lord , Grim Reaper or Ferumbras [rare])"
        ],
        "resistance": [
            "Physical 105%",
            "Death 105%",
            "Holy 80%",
            "Ice 80%",
            "Fire 100%",
            "Energy 105%",
            "Earth 100%"
        ],
        "location": "Cemetery Quarter, Vengoth Castle, Vandura Mountain, Robson Isle.",
        "behaviour": "Never flees. Always fights in close range.Nightstalker attacks in melee range.",
        "strategy": "All vocations: Remember to bring a garlic necklace when hunting these, as it blocks a considerable amount of damage from their strongest attack and it is also inexpensive. If you plan to hunt for long bring about one necklace per each hour you plan hunting (they last longer than one would think). Don't let him get closer or he will use his strong life drain attack on you.\nKnights should  use full attack and kill them as fast as possible. Killing them before they get the chance to use their life drain attack can save you any means of healing at all, as their melee will often be weak. The many chances of getting rare items and high gold drop mean this monster can be hunted without a huge waste at lvl 60+.",
        "loot": [
            "Gold Coin",
            "Strong Mana Potion",
            "Shadow Herb",
            "Crystal Ring",
            "Protection Amulet",
            "Spirit Cloak",
            "Platinum Amulet",
            "Boots of Haste",
            "Haunted Blade",
            "Chaos Mace",
            "Crystal of Balance",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Phantasm_(Weak)",
        "name": "Phantasm (Weak)",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/4/42/Phantasm_%28Weak%29.gif/revision/latest?cb=20150530072758&path-prefix=en",
        "attributes": {},
        "abilities": [
            "Melee (0-15)",
            "Death Hit (34-59)",
            "Drowning Wave (makes you drown)",
            "Great Intoxicating Ball on itself (makes you drunk )",
            "Invisibility",
            "Explosion Exori (5-7)",
            "Red Sparkles on itself ( Haste ?)",
            "Frequent Self-Healing"
        ],
        "resistance": [
            "Physical 0%",
            "Death 0%",
            "Holy 110%",
            "Ice 80%",
            "Fire 110%",
            "Energy 60%",
            "Earth 0%"
        ],
        "location": "In the beginning of the Caves of Inferno, just after the Pile of Bones with small rewards. It is also summoned by Phantasm.",
        "behaviour": "Weaker version of Phantasm",
        "strategy": "It is recommended to shoot GFBs to kill the summons, else you might get yourself trapped very easily, as Phantasms usually spawn in bigger groups.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Phantasm",
        "name": "Phantasm",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/6/61/Phantasm.gif/revision/latest?cb=20150418075859&path-prefix=en",
        "attributes": {},
        "notes": "Phantasms are said to be the dreams of madmen. Abducted from their dreamers on the backs of nightmares, they are unpredictable allies of chaos. Obviously destructive, their complete and absolute madness makes it hard to control them. However, some of the demonlords enjoy their service since their essence is quite close to the souls of mortals that those demons cherish. Some Phantasms are not created by the deeds of demons, but break loose from their mad dreamers by happenings in the world of the mortals or due to things that cannot be understood by those of sane minds. All Phantasms are able to shift from the realm of dreams to the real world and back at will, although their mental disposition makes it rarely a conscious decision. Still their physical form is an illusion and intangible. Their state of existence grants them some ghostly powers that they use to affect minds. Only the most powerful and mad Phantasms exists for a longer time. Their energy constantly leaking away, most of them fade into nothingness after a while if they cannot substitute this energy by stolen life forces. Their summoned phantasms have only 65 HP and are immune to Earth Damage, but they can do a lot of damage. Phantasms' boss is Countess Sorrow located in Bazir's throne room.",
        "abilities": [
            "Melee (0-470)",
            "Death Hit (248-510)",
            "Drowning Wave makes you drown",
            "Summons (1-3 Phantasm (Weak) )",
            "Invisible",
            "Drunkenness Explosion",
            "Mana Drain Exori (5-80)",
            "Frequent Self-Healing (228-449)",
            "Haste"
        ],
        "resistance": [
            "Physical 0%",
            "Death 0%",
            "Holy 110%",
            "Ice 80%",
            "Fire 110%",
            "Energy 110%",
            "Earth 80%"
        ],
        "location": "Pits of Inferno, The Inquisition Quest, Deeper Banuta (single spawn, here) and Grounds of Deceit.",
        "behaviour": "Runs in deep low health(around 350), attacks target and summons weaker phantasms rapidly.Attacks in melee range.",
        "strategy": "Mages should use energy strikes or energy wave to kill them fast. It is also recommended to shoot GFBs to kill the summons.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Blank Rune",
            "Great Mana Potion",
            "Shadow Herb",
            "Demonic Essence",
            "Small Amethyst",
            "Small Emerald",
            "Small Ruby",
            "Small Topaz",
            "Ultimate Health Potion",
            "Shadow Sceptre",
            "Stealth Ring",
            "Crown Armor",
            "Death Ring",
            "Abyss Hammer",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Reflection_of_Mawhawk",
        "name": "Reflection of Mawhawk",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/d4/Reflection_of_Mawhawk.gif/revision/latest?cb=20221126184902&path-prefix=en",
        "attributes": {},
        "notes": "It's somehow related to the Mawhawk and very similar to it in power. Part of the Opticording Sphere Quest.",
        "abilities": [
            "Melee (0-1000+)",
            "explosion wave (0-500+)",
            "Self-Healing (?)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Chamber of Reflections",
        "behaviour": "Attacks at close range. A reflection of Mawhawk never retreats.",
        "strategy": "Treat it like a regular Mawhawk, though the fight should be easier without the summons and other Guzzlemaws.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Cluster of Solace",
            "Green Crystal Splinter",
            "Blue Crystal Splinter",
            "Frazzle Tongue",
            "Unrealized Dream",
            "Brown Crystal Splinter",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Retching_Horror",
        "name": "Retching Horror",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/70/Retching_Horror.gif/revision/latest?cb=20131126125338&path-prefix=en",
        "attributes": {},
        "notes": "The Retching Horror is an abomination of dreams, twisted and contorted. It feeds on smaller dreams and creatures like a parasite, creeping up on them and swallowing them whole. Retching Horrors do not digest their prey, but absorb it, building it into themselves and perverting everything about it, trying to block out the eternal pain they are suffering, but only adding to it with every new victim. Occasionally, they cough up horrible diseased dreams and pains, items, flies, arrows; and if they wish, they speak with different voices to ensnare and terrify their prey. Their fingers are live white worms that they use to plunge into living flesh and suck out body fluids, filling the victim afterwards with their own chitinous glue before swallowing it. Their mouth is surrounded by pallid tendril-feelers that they use to sniff out particular delicacies, and they can smell prey several miles off. As their flesh is raw, they dislike being touched, being constantly in pain, and so keep a little distance to their victims.",
        "abilities": [
            "Melee (0-500)",
            "Arrows (0-300)",
            "large groggy explosion ( Paralyzes you)",
            "green shimmering effect fire wave (200-450)",
            "drunken hit",
            "Groundshaker (50-300)",
            "Self-Healing (?)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 80%",
            "Holy 100%",
            "Ice 85%",
            "Fire 15%",
            "Energy 103%",
            "Earth 0%"
        ],
        "location": "All over the surface of Upper Roshamuul and Nightmare Isles.",
        "behaviour": "Follows the target.A retching horror attacks in melee range. A retching horror never retreats.",
        "strategy": "Similar to a Choking Fear, with which they are often in company. Might look strong from its many abilities, but rarely utilizes half of them. Knights are best suited to deal with these.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Goosebump Leather",
            "Brown Mushroom",
            "Pool of Chitinous Glue",
            "Great Health Potion",
            "Great Mana Potion",
            "Beastslayer Axe",
            "Broken Dream",
            "Underworld Rod",
            "Mercenary Sword",
            "Crown Shield",
            "Spiked Squelcher",
            "Wand of Starstorm",
            "Fire Sword",
            "Tower Shield",
            "Onyx Flail",
            "Butcher's Axe",
            "Steel Boots",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Shimmying_Butterfly",
        "name": "Shimmying Butterfly",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/97/Shimmying_Butterfly.gif/revision/latest?cb=20171218204725&path-prefix=en",
        "attributes": {},
        "notes": "When a Shiversleep is hypnotized, it believes itself to be a butterfly: the Shimmying Butterfly.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 101%>?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 0%"
        ],
        "location": "Roshamuul Cistern, enclosed cavern, appears when using Pendulum on Shiversleep and Broken Dreams on Half-Buried Faces.",
        "behaviour": "Follows its target around but does not harm them.",
        "strategy": "Leave them alone. If you kill them, the Dream Butterfly will curse you (very minor damage) when you next speak to it.",
        "loot": [
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Shiversleep",
        "name": "Shiversleep",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/4/45/Shiversleep.gif/revision/latest?cb=20131130172050&path-prefix=en",
        "attributes": {},
        "notes": "They are the overlords of their brethren, but they struggle to control them. They are similar in strength or even weaker than their breathren. When you enter the chamber you are ambushed by 3 of them.",
        "abilities": [
            "Melee (0-411)",
            "large poison bomb (does nothing?)",
            "large red sparkle bomb (50-75)",
            "Debuff (Reduces Distance )",
            "Self-Healing (450-550)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 110%",
            "Ice 100%?",
            "Fire 65%",
            "Energy 100%?",
            "Earth 0%"
        ],
        "location": "3 in Roshamuul Cistern, an enclosed chamber.",
        "behaviour": "Unknown",
        "strategy": "Use the Pendulum on them and then enter the Instable Vortex on the west of the chamber. They will turn into a Shimmying Butterfly. You have limited time to do this.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Ultimate Health Potion",
            "Small Amethyst",
            "Blue Crystal Splinter",
            "Great Mana Potion",
            "Small Ruby",
            "Small Topaz",
            "Trapped Bad Dream Monster",
            "Cluster of Solace",
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Shock_Head",
        "name": "Shock Head",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/d7/Shock_Head.gif/revision/latest?cb=20140215171824&path-prefix=en",
        "attributes": {},
        "notes": "The shock head is a strange hybrid mix of a demon and a nightmare creature. It is impossible to tell if these creatures were once bred on purpose or if they are just some strange freak of nature. Their demonic nature gives them a more physical and reality-bound body, as well as the ability to breed. Their nightmarish origin bestows them several unique abilities and the resistance to the nightmare-ridden areas of Roshamuul. The shock head is disturbingly well suited to survive even in environments most hostile to life. To describe it as omnivore is an understatement since it does not only devour plants, meat and carrion without prejudice, it also consumes minerals, blood, life energy and even dreams. Its digestive system compresses everything that is not exploitable into rocklike structures that can be spat out like a bullet. Probably due to natural selection, the shock head population is extremely resilient, aggressive and dangerous. The regenerative powers of these creatures have captured the attention of alchemists that are trying to use several parts of the shock head as substitutes in health potions. Their eye-like organs are not used for vision, but as a weapon that can confuse foes in a distance and temporarily drains their skills. Lacking any form of intelligence, the shock heads are mindless beasts that roam the ruins of Roshamuul where they originated. Occasionally, large packs of shock heads band together at coastal areas for a strange ritual in which they howl to the moon in disharmonious unison, which is rumoured to drive listeners mad and trap them in eternal nightmares. Oddly enough, their bestial minds can be overwritten by certain means and they can be tamed. This process seems to be a permanent one, and has led to the shock heads leaving their original habitat of Roshamuul and breeding at other places. Inattentive and unscrupulous tamers helped to spread these creatures, and so they may be encountered in other places, since each following generation displays the normal wild and dangerous behaviour rather than that of their docile parents.",
        "abilities": [
            "Melee (0-350)",
            "Energy Wave",
            "Tar Wave (0-606)",
            "Groundshaker Bomb on target",
            "Red Sparks Ball around itself (Reduces Magic Level by 50-80% for 6 seconds)",
            "Self-Healing (185-215)"
        ],
        "resistance": [
            "Physical 90%",
            "Death 80%",
            "Holy 100%",
            "Ice 75%",
            "Fire 0%",
            "Energy 90%",
            "Earth 0%"
        ],
        "location": "Sparsely in eastern Lower Roshamuul (here) and southern Guzzlemaw Valley (here).",
        "behaviour": "A shock head attacks in melee range. A shock head will retreat at 168 to 1259 (4% - 29.98%, red) health.",
        "strategy": "Always stay diagonal. Despite this monster having an Energy-related name, it does not walk over Energy Fields. This monster is very undesirable to kill as it gives bad Loot and Experience for its difficulty. Recommended to tame and only kill during the quest.",
        "loot": [
            "Gold Coin",
            "Small Sapphire",
            "Royal Helmet",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Sight_of_Surrender",
        "name": "Sight of Surrender",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/2/21/Sight_of_Surrender.gif/revision/latest?cb=20210420144728&path-prefix=en",
        "attributes": {},
        "notes": "Called \"sight of surrender\" because whatever they lay their sight on, will cease to exist in a matter of moments. They are loners, usually appearing solitary but will not hesitate to attack in groups. They see themselves as some kind of custodians of the walls of Roshamuul and rarely depart from their seemingly self-imposed duty of guarding what belongs to them. Fighting them is extremely dangerous and wearisome as they are extraordinary battle-hardened with near impenetrable armor and only one weak spot - their eye. They will always try to force everything in the sight to surrender so there is either victory or...",
        "abilities": [
            "Melee (0-1100)",
            "Yellow Sparks Energy Beam (500-700)",
            "Stone Projectile (200-500)",
            "Self-Healing (800-1200) Sight of Surrender",
            "Strong Haste"
        ],
        "resistance": [
            "Physical 70%",
            "Death 80%",
            "Holy 105%",
            "Ice 60%",
            "Fire 65%",
            "Energy 90%",
            "Earth 80%"
        ],
        "location": "Dark Grounds, Guzzlemaw Valley (if less than 100 Blowing Horns tasks have been done the day before, spawn locations) and the Silencer Plateau (when Silencer Resonating Chambers are used there).",
        "behaviour": "A sight of surrender attacks in melee range.",
        "strategy": "Be very careful when running or hunting in the Guzzlemaw Valley if there are Sights of Surrenders spawning. Not only they deal considerable damage, their huge health pool and high self healing means they take a long time to die. They are not worth hunting for Experience, but if in case you decide to kill them during regular hunts or for loot, a minimum of 2 players is recommended to take them down faster. Avoid staying in front of them and mind the other creatures in the area. It's usually best to first clear everything around it using AoE attacks and them focus on the Sight of Surrender using single target attacks.",
        "loot": [
            "Platinum Coin",
            "Broken Visor",
            "Sight of Surrender's Eye",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Great Spirit Potion",
            "Blue Crystal Splinter",
            "Green Crystal Splinter",
            "Brown Crystal Splinter",
            "Violet Crystal Shard",
            "Blue Crystal Shard",
            "Green Crystal Shard",
            "Stone Skin Amulet",
            "Might Ring",
            "Crystal Mace",
            "Cluster of Solace",
            "Magic Plate Armor",
            "Steel Boots",
            "Jade Hammer",
            "Tower Shield",
            "Hammer of Wrath",
            "Onyx Flail",
            "Crusader Helmet",
            "Crown Legs",
            "String of Mending",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Silencer",
        "name": "Silencer",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/dd/Silencer.gif/revision/latest?cb=20131126125103&path-prefix=en",
        "attributes": {},
        "notes": "The silencers are roaming in packs and will hunt down everything which is too loud for their sensitive ears and does not belong to their kin. Of course, only if their victim is smaller or weaker. It is rumoured that they actually communicate with each other. They seem to call other silencers for help or even organise themselves in some way. However, if they are aggravated in any way, they are extremely tough and unpredictable adversaries.",
        "abilities": [
            "Melee (0-350+ and starting up to 30 hp/turn)",
            "Mana Drain (0-110+)",
            "Thunderstorm missile (Reduces Magic Level by 30-80% for 6 seconds)",
            "Strong Haste",
            "Self-Healing (?)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 35%",
            "Holy 125%",
            "Ice 85%",
            "Fire 70%",
            "Energy 85%",
            "Earth 0%"
        ],
        "location": "All over the Roshamuul surface and Nightmare Isles.",
        "behaviour": "Retargets rarely. Has a pretty high speed.A silencer attacks in melee range. A silencer never retreats.",
        "strategy": "A largely melee-based creature, its most dangerous feature is the Magic Level debuff missile. Mages, especially, might want to avoid hunting these solo. Be careful because their Magic Level debuff (and thus the reduced ability to heal) coupled with comboes from other monsters can easily kill a level 150. Can be trapped easily by field runes.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Silencer Claws",
            "Assassin Star",
            "Silencer Resonating Chamber",
            "Dark Shield",
            "Glorious Axe",
            "Titan Axe",
            "Haunted Blade",
            "Stealth Ring",
            "Terra Legs",
            "Diamond Sceptre",
            "Terra Boots",
            "Shadow Sceptre",
            "Boots of Haste",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Sin_Devourer",
        "name": "Sin Devourer",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/31/Sin_Devourer.gif/revision/latest?cb=20160417190428&path-prefix=en",
        "attributes": {},
        "notes": "Apppears in the Ferumbras' Ascension Quest with Shulgrax.",
        "abilities": [
            "Mana Drain (100-200)",
            "Debuff (Reduces Magic Level by 40-50%)"
        ],
        "resistance": [
            "Physical 0%",
            "Death 0%",
            "Holy 0%",
            "Ice 0%",
            "Fire 0%",
            "Energy 0%",
            "Earth 0%"
        ],
        "location": "Grounds of Damnation in Shulgrax's room.",
        "behaviour": "Keeps a distance.",
        "strategy": "They can't be killed directly, so to get rid of them you have to kill the Damned Souls first and then use the Purified Souls on the Sin Devourers.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Terrorsleep",
        "name": "Terrorsleep",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/9c/Terrorsleep.gif/revision/latest?cb=20131126125247&path-prefix=en",
        "attributes": {},
        "notes": "The terrorsleep is sweating dread incorporated. It thrives in darkness, breeds under your bed and nourishes on your fear. Terrorsleeps avoid the sunlight as it stuns and disorientates them. They do not see as we do, but sense other creatures' body warmth and fear. Hungry, toothed mouths protrude on their head instead of eyes. Using their mouths like augers, they bite open their victims and bathe in their bloody carcass like birds in a water pool. Terrorsleeps have very light and flexible bones and can squeeze through anywhere. They particularly like to slither and slime through dark, dank places, searching and sniffing out anything warm, alive; feeding on its fear, coveting its warmth, sucking out its life force. Their whitish belly is swollen with terror juices that foam up as gooey, frothy saliva hanging in threads and webs from their bared teeth. Touching it instils horrible paranoia and paralyses the victim so that the terrorsleep can devour it. Their putrid, blood-soaked wings they use to stabilise themselves and to swim or soar through darkness to reach ever deeper, isolated places. Once you are in darkness, you are never safe from a terrorsleep.There are surmises that the original beasts might have once been intended as riding animals or messengers, but were corrupted by horrific experiments or the negative energies of Roshamuul. In their company, the terrorsleep only tolerate creatures similar to themselves: the feversleeps who are burning hot and sweaty to the touch and who love cool water, are perhaps the offspring of the terrorsleep or a sibling creature from a nightmare having taken shape. The shy shiversleeps however are the rarest of the terrorsleep family; they like shallow, warm water and are very territorial, disappearing like mist through suddenly opening vortices into the protective darkness, and very little is known about them at all.",
        "abilities": [
            "Melee (0-400)",
            "Mana Drain (70-100)",
            "Life Drain Spark Beam (350-500)",
            "Death Strike (200-450)",
            "Debuff (Reduces Distance by ~50% for 8 seconds)",
            "Sudden Death (Reduces Melee by 55-60% for 5 seconds)",
            "Envenom",
            "Self-Healing (0-600)",
            "Haste"
        ],
        "resistance": [
            "Physical 85%",
            "Death 45%",
            "Holy 110%",
            "Ice 95%",
            "Fire 65%",
            "Energy 105%",
            "Earth 0%"
        ],
        "location": "Roshamuul Mines (down here), Roshamuul Cistern (down here),\nNightmare Isles (Nightmare Teddy quest floor).",
        "behaviour": "A terrorsleep attacks in melee range.",
        "strategy": "Knights: You will have a hard time with these. They are very resistant to physical and heal frequently. On top of that, they will almost constantly deal heavy damage. Be wary of their debuff which will reduce your melee skills, because they use it often and it adds up. The best strategy to is to keep an eye on your melee skill and use Fierce Berserk, Front Sweep, or Berserk when your skill isn't reduced, while challenging them, to prevent them escape on deep red health. The fight will typically last a little while so be careful not to lure more. The best melee element against them is energy, so sanguine razor and soulmaimer work well there.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Small Ruby",
            "Small Topaz",
            "Blue Crystal Shard",
            "Trapped Bad Dream Monster",
            "Bowl of Terror Sweat",
            "Blue Crystal Splinter",
            "Cyan Crystal Fragment",
            "Small Emerald",
            "Small Amethyst",
            "Broken Dream",
            "Blue Piece of Cloth",
            "Fish Fin",
            "Warrior Helmet",
            "White Piece of Cloth",
            "Knight Armor",
            "Blue Robe",
            "Giant Sword",
            "Red Piece of Cloth",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Thanatursus",
        "name": "Thanatursus",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/c/c4/Thanatursus.gif/revision/latest?cb=20200804173248&path-prefix=en",
        "attributes": {},
        "notes": "The thanatursus is one of the few nightmare-twisted creatures that could establish itself as a new species. These creatures, that once probably just were common bears, became dangerous predators of berserk-like frenzy. The thanatursus is a carnivore that doesn't even shun away from carrion. In the contrary: it's known that the deformed bears often drag their kills into lairs, where they rot for a while before they are eaten. It seems the thanatursus does so for a more practical reason though. Observations lead to the theory that a thanatursus does absorb certain traits and even physical characteristics from their eaten prey. This seems to be more intense, the more fresh the devoured creature is. The natural instinct of the bear-creature seems to be to hide the carrion away for a later date, but if a fight with a victim drags on and drains more energy and blood then usual, the thanatursus is more likely to feast on it immediately. This probably leads to it mostly absorbing traits from more formidable foes and become more and more powerful over time. An average, grown up thanatursus combines the power and appearance of a couple of their prey. Some of them develop horns, similar to bulls or stags, most display the snout of a boar or fangs of a wolf. Some added more disturbing elements like human-like hands, elf-like faces or the wings of a giant bat. Even scales and tentacles are possible additions to their body. While the common thanatursus is an enough disturbing sight and threat, their very nature makes vastly different and more powerful variants a possibility. Sadly it's more than just a rumour that some of these creatures escaped the dream realms and began to roam the realm of Tibia. Though loners, these individuals acquired considerable power and already changed into creatures vastly different from the common thanatursus. With men as part of their common diet, they developed intelligence and ambition, preying on more and more dangerous foes to add their strengths to their own array of abilities.",
        "abilities": [
            "Melee (0-450+)",
            "Energy Strike (200-350)",
            "Holy Berserk (200-300)",
            "Sparky Ball (200-300)",
            "Sparky Attack (200-300)"
        ],
        "resistance": [
            "Physical 70%",
            "Death 120%",
            "Holy 80%",
            "Ice 100%",
            "Fire 100%",
            "Energy 50%",
            "Earth 100%"
        ],
        "location": "Haunted Temple, Court of Winter, Court of Summer, Dream Labyrinth",
        "behaviour": "Fights in close combat. Does not retarget unless challenged or its path to the initial target is blocked.A thanatursus attacks in melee range. A thanatursus will retreat at 20  (0.28%, deep red) health.",
        "strategy": "They have a lot of health, so take your time with them. Mages should use Sudden Death Runes if there's only one Thanatursus due to their high Death Damage weakness.",
        "loot": [
            "Platinum Coin",
            "Meat",
            "Ham",
            "Essence of a Bad Dream",
            "Halberd",
            "Terra Boots",
            "Ultimate Health Potion",
            "Terra Hood",
            "Great Spirit Potion",
            "Knight Axe",
            "Mino Shield",
            "Dark Shield",
            "Wand of Cosmic Energy",
            "Beastslayer Axe",
            "Sickle",
            "Black Shield",
            "Warrior's Shield",
            "Obsidian Lance",
            "Bloody Pincers",
            "Titan Axe",
            "Wand of Defiance",
            "Warrior's Axe",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Weakened_Frazzlemaw",
        "name": "Weakened Frazzlemaw",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/4/49/Weakened_Frazzlemaw.gif/revision/latest?cb=20170709121030&path-prefix=en",
        "attributes": {},
        "notes": "The Weakened Frazzlemaw is a weaker version of Frazzlemaws. It's a weaker version of a Frazzlemaw.\nYou need to kill 200 Enfeebled Silencers and Weakened Frazzlemaws as part of the Threatened Dreams Quest.",
        "abilities": [
            "Melee (0-400+)",
            "Bleeding Stone Explosion Weakened Frazzlemaw",
            "Paralyze Red Shimmer Ball Weakened Frazzlemaw",
            "Explosion Beam (0-500) Weakened Frazzlemaw",
            "Blood Berserk (0-300) Weakened Frazzlemaw",
            "Frazzle Burp Weakened Frazzlemaw",
            "Self-Healing (0-50+)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 90%",
            "Holy 105%",
            "Ice 95%",
            "Fire 90%",
            "Energy 85%",
            "Earth 80%"
        ],
        "location": "Feyrist - Cave here and Mountains here",
        "behaviour": "A weakened frazzlemaw attacks in melee range. A weakened frazzlemaw never retreats.",
        "strategy": "Avoid staying in front of it because its beam is its strongest attack, also be wary of your HP as the Bleeding damage ramps up quickly.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Frazzle Skin",
            "Bone",
            "Fairy Wings",
            "Skull (Item)",
            "Great Mana Potion",
            "Remains of a Fish",
            "Frazzle Tongue",
            "Fish",
            "Great Health Potion",
            "Ham",
            "Big Bone",
            "Piece of Iron",
            "Fish Fin",
            "Iron Ore",
            "Sai",
            "Nightmare Blade",
            "Cluster of Solace",
            "Loot Statistics"
        ]
    }
]