[
    {
        "url": "https://tibia.fandom.com/wiki/Captured_Dwarf",
        "name": "Captured Dwarf",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/51/Captured_Dwarf.gif/revision/latest?cb=20171220190145&path-prefix=en",
        "attributes": {},
        "notes": "This dwarf joined the Lost but was captured from his Makeshift Home.\nPart of the Dangerous Depths Quest.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Gnome Deep Hub.",
        "behaviour": "It will follow you around without attacking you.",
        "strategy": "Guide it to the dungeon's entrance to imprison it.",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Crazed_Dwarf",
        "name": "Crazed Dwarf",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/7d/Crazed_Dwarf.gif/revision/latest?cb=20171219235252&path-prefix=en",
        "attributes": {},
        "notes": "A weak Dwarf. Spawns around Muglex Clan Goblins, Lesser Fire Devils, Wasps, Spiders, Dwarf Miners and others. Unlike regular Dwarves they don't seem to drop Copper Shields. They do, however, drop Plate Shields.",
        "abilities": [
            "Melee (0-15+?)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Dawnport.",
        "behaviour": "Unknown",
        "strategy": "Just kill it. They have high defense so make sure the area is clear and avoid running into monsters; especially watch out for Lesser Fire Devils.",
        "loot": [
            "Gold Coin",
            "White Mushroom",
            "Hatchet",
            "Plate Shield",
            "Axe",
            "Leather Legs",
            "Pick",
            "Studded Armor",
            "Letter",
            "Dwarven Ring",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dwarf_Geomancer",
        "name": "Dwarf Geomancer",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/0d/Dwarf_Geomancer.gif/revision/latest?cb=20171218205327&path-prefix=en",
        "attributes": {},
        "notes": "It is a widespread misconception that dwarfs dislike all kinds of magic. Dwarfs worship the powers of the elements, and the most gifted among them have managed to master the raw forces of earth and fire. Like all others of their race, Dwarf Geomancers are sturdy and strong. Instead of using the axe, they call on the power of earth to smash their enemies, hurling balls of molten rock at whoever is opposing them. Even worse, earth also confers amazing healing powers on Dwarf Geomancers, making them formidable enemies that are difficult to overcome. These creatures heal a lot more often than Monks.",
        "abilities": [
            "Melee (0-100)",
            "Mana Drain (25-80)",
            "Stalagmite (50-110)",
            "Fast Self Healing (25-130)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 110%",
            "Holy 90%",
            "Ice 105%",
            "Fire 40%",
            "Energy 90%",
            "Earth 80%"
        ],
        "location": "Mount Sternum Undead Cave, Dwarf Mines, Circle Room in Kazordoon, Triangle Tower, Tiquanda Dwarf Cave, Cormaya Dwarven Cave, Beregar Mines.",
        "behaviour": "A dwarf geomancer attacks from a distance. A dwarf geomancer will retreat at 150  (39.47%, yellow) health.",
        "strategy": "It is recommended to kill these creatures in groups, due to the fact that they heal fast. Try to use all of your mana before facing them, as they will quickly drain it away from you.Mages: Mages of level 45+ should use 1-2 SD shots fast on these creatures since they heal a lot and have a very strong mana drain which would be more expensive than the SD runes.Knights: With 75/75 skills and level 40+ you can let them run in a spot where they cannot move (like the treasure room entrance in circle room) or a corner then melee them to death, before they run into a bunch of other creatures. Casting Blood Rage before facing them is a good strategy.Paladins: Level 40+ paladins should run with bolts and maybe Icicle runes.",
        "loot": [
            "Gold Coin",
            "Blank Rune",
            "Pear",
            "White Mushroom",
            "Magic Light Wand",
            "Geomancer's Robe",
            "Geomancer's Staff",
            "Clerical Mace",
            "Dwarven Ring",
            "Small Sapphire",
            "Terra Boots",
            "Iron Ore",
            "Spellbook",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dwarf_Guard",
        "name": "Dwarf Guard",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/f/f6/Dwarf_Guard.gif/revision/latest?cb=20210420143429&path-prefix=en",
        "attributes": {},
        "notes": "Dwarf Guards are a kind of militia among the dwarfs. They are very cunning and strong fighters and know the surroundings quite well. Their strategy is to lure small groups of intruders into traps that they have built using their astonishing craftsmanship. The strongest in Melee of the Dwarves, they also have a high defence. They move items and kill weak creatures in their way.",
        "abilities": [
            "Melee (0-140)"
        ],
        "resistance": [
            "Physical 80%",
            "Death 105%",
            "Holy 100%",
            "Ice 100%",
            "Fire 105%",
            "Energy 100%",
            "Earth 80%"
        ],
        "location": "Kazordoon Dwarf Mines, Dwacatra, Ferngrims Gate, Cyclopolis, Mount Sternum Undead Cave, Stonehome Rotworm cave (near Edron), Maze of Lost Souls, Tiquanda Dwarf Cave, Beregar, Cormaya Dwarf Cave.",
        "behaviour": "Dwarf Guards are also known to retarget.A dwarf guard attacks in melee range. A dwarf guard never retreats.",
        "strategy": "Knights: A decent level and with good skills are highly recomennded for these creatures. A level 20+ with 60/60 and with a knight set and dragon shield can kill one of these on defensive fighting, but will lose half of their health, if not healing. A level 45 with 75/75 would be able to kill these with little waste, although 85/85 is the ideal skill range. You might want use Berserk in case you become surrounded by these. Paladins: Can kill these at low levels because they are slow and don't have distance attacks. But if you get trapped by other creatures then you will die fast. Using GFB should help to prevent this. Mages: Similar to the paladins, using wands or rods of fire/death Damage. On higher levels, with a good magic level, you should use the level 33+ wands/rods and, if Premium Account use Flame Strike. A mage of level 35 and magic level 45 is recommended for those who wish not to waste.",
        "loot": [
            "Gold Coin",
            "Leather Boots",
            "White Mushroom",
            "Scale Armor",
            "Battle Shield",
            "Battle Hammer",
            "Steel Helmet",
            "Double Axe",
            "Iron Ore",
            "Health Potion",
            "Small Amethyst",
            "Axe Ring",
            "Coal",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dwarf_Henchman",
        "name": "Dwarf Henchman",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/08/Dwarf_Henchman.gif/revision/latest?cb=20180206145426&path-prefix=en",
        "attributes": {},
        "notes": "Dwarf henchmen are a rare kind of Dwarves which is only found in a certain place. In order to reach them you must have advanced to the 7th mission of the Secret Service Quest.",
        "abilities": [
            "Melee (0-50)",
            "Drown Hit (20)",
            "Envenom (up to 4hp/turn)",
            "Makes you Drown (20 hp /4 turns)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 100%",
            "Holy 100%",
            "Ice 100%",
            "Fire 100%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "In Kazordoon, under Talphion behind sealed door, here.",
        "behaviour": "A dwarf henchman attacks in melee range. A dwarf henchman never retreats.",
        "strategy": "Kill these fast with area attack spells like Divine Caldera/Groundshaker or runes such as GFB. The Dwarf Dispenser summons an unlimited amount of them. The faster you do it the less you will waste. A group of 3 mages throwing Great Fireballs, should kill them fast with little problem.",
        "loot": [
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dwarf_Miner",
        "name": "Dwarf Miner",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/38/Dwarf_Miner.gif/revision/latest?cb=20180206145427&path-prefix=en",
        "attributes": {},
        "notes": "Most dwarfs have a special connection to their profession and are very proud of it. Most professions hold several secrets which they share only among their own members. Dwarf Miners, however, are particularly protective about their secrets. This attitude often borders on obsession and in certain cases even crosses this border. To make matters worse, most Dwarf Miners are very attached to their mines, their tools, their ore, and their stones. Taking this into account, it becomes obvious that it needs only little to provoke the wrath of a Dwarf Miner.Even though, most Dwarf Miners are happy to dig through earth and stone in some mine beneath the Big Old One, some of them seek their luck elsewhere. Many of those \"emigrants\", however, were forced to leave their home and their beloved mines. Most of them displayed an aggressive behaviour that was unacceptable even for dwarven standards. For this reason, they were sent away by their fellow miners to search for ore in other mines. Now they are living in some kind of exile away from the dwarven society. Other dwarfs that can be found in places far away from the Big Old One are renegades. Not aggressiveness but greed made them leave the dwarven society. Some of them actually stole mining secrets to use them to gain a fortune in other areas away from Kazordoon and a society who considered them as criminals due to their evil deeds.Not driven by aggressiveness but by greed and their efforts to protect their wealth by all means, they tend to attack everyone they encounter in their mines. The result, however, is the same: a mad pick axe swinging dwarf that is trying to hack the intruder into pieces. Everything that Dwarf Miners might lack in skill, they make up with their exceptional constitution and an enormous strength, often accompanied by their anger and fury. New creature in Summer Update 2008. They are quite useful for training due to their high health. These creatures are very similar to Orc Warriors.",
        "abilities": [
            "Melee (0-35)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 100%",
            "Holy 100%",
            "Ice 100%",
            "Fire 100%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Dawnport and Island of Destiny (Knight area).",
        "behaviour": "Dwarf Miners act very much like regular Dwarves A dwarf miner never retreats.",
        "strategy": "Bring boxes or Honey Flowers to block them, so that you don't get hit by more than 2 at once.",
        "loot": [
            "Gold Coin",
            "Axe",
            "Leather Legs",
            "Pick",
            "Studded Armor",
            "Meat",
            "Dwarven Ring",
            "Iron Ore",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dwarf_Soldier",
        "name": "Dwarf Soldier",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/6/6c/Dwarf_Soldier.gif/revision/latest?cb=20220711121623&path-prefix=en",
        "attributes": {},
        "notes": "Dwarf Soldiers form the dwarfs' army. They are quite strong fighters and know how to make use of the complex terrain very well. Due to their shortness they can use passages through the mountains where nobody can follow them and attack with their crossbows from hiding-places where nobody expects them. Strong creatures able to use both Melee and distance combat. Dwarf Guards and Dwarf Soldiers are the most hunted kind of Dwarves since they have the highest drop rate of Iron Ores. They are also among the most profitable creatures in game.",
        "abilities": [
            "Melee (0-70)",
            "Bolts (0-60) Dwarf Soldier"
        ],
        "resistance": [
            "Physical 100%",
            "Death 105%",
            "Holy 100%",
            "Ice 100%",
            "Fire 105%",
            "Energy 100%",
            "Earth 90%"
        ],
        "location": "Kazordoon Dwarf Mines, Cyclopolis, Dwacatra, Ferngrims Gate, Dwarf Bridge, Mount Sternum Undead Cave, Beregar, Tiquanda Dwarf Cave, Cormaya Dwarf Cave.",
        "behaviour": "A dwarf soldier attacks in melee range. A dwarf soldier never retreats.",
        "strategy": "Low levels should avoid them as they can hurt quite badly. When they are in low health, their bolts seem to be stronger, so be aware if you think you have almost killed them.\nMages: Sorcerers should use a wand with Fire Damage and Druids should use a rod with Death Damage because they are weak to fire and death. To kill faster, premium mages should use Flame Strike or Death Strike.",
        "loot": [
            "Gold Coin",
            "White Mushroom",
            "Bolt",
            "Soldier Helmet",
            "Shovel",
            "Chain Armor",
            "Piercing Bolt",
            "Dwarven Shield",
            "Crossbow",
            "Battle Axe",
            "Iron Ore",
            "Axe Ring",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dwarf",
        "name": "Dwarf",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/73/Dwarf.gif/revision/latest?cb=20150418075532&path-prefix=en",
        "attributes": {},
        "notes": "Dwarfs are a very ancient human-like race. Once they were famous all over Tibia for their craftsmanship, but since the War over the Creation they only hide in their fortresses beneath the mountains and have discontinued all contact with humans. They are very suspicious towards any intruder and will vigorously try to repel him from their realms. These creatures live in caves and mines. They're commonly used by low level knights for training purposes.",
        "abilities": [
            "Melee (0-31)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 105%",
            "Holy 100%",
            "Ice 100%",
            "Fire 105%",
            "Energy 100%",
            "Earth 90%"
        ],
        "location": "Kazordoon Dwarf Mines, Dwarf Bridge, deep Elvenbane, Tiquanda Dwarf Cave, Cormaya Dwarf Cave, Island of Destiny (Knights area), Beregar.",
        "behaviour": "A dwarf attacks in melee range. A dwarf never retreats.",
        "strategy": "Just attack them but be careful because they are usually found in groups and can be accompanied with Dwarf Soldiers and Dwarf Guards.",
        "loot": [
            "Gold Coin",
            "White Mushroom",
            "Hatchet",
            "Axe",
            "Copper Shield",
            "Pick",
            "Leather Legs",
            "Studded Armor",
            "Letter",
            "Dwarven Ring",
            "Iron Ore",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Grodrik_(Creature)",
        "name": "Grodrik (Creature)",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/1/1c/Grodrik_%28Creature%29.gif/revision/latest?cb=20180618011322&path-prefix=en",
        "attributes": {},
        "notes": "Someone spawns and despawns this creature during The Scatterbrained Sorcerer Quest - Mission 3: Love's a Wicked Game.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "In a Void in the space-time continuum under Eclesius' house.",
        "behaviour": "Unknown",
        "strategy": "Unknown",
        "loot": [
            "Submit loot statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Memory_of_a_Dwarf",
        "name": "Memory of a Dwarf",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/54/Memory_of_a_Dwarf.gif/revision/latest?cb=20220108232509&path-prefix=en",
        "attributes": {},
        "notes": "It's a strengthened Dwarf Guard.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Time Travel Dungeon",
        "loot": [
            "Small Amethyst",
            "Ring of Healing",
            "Battle Hammer",
            "White Mushroom",
            "Gold Coin",
            "Glacier Mask",
            "Battle Shield",
            "Axe Ring",
            "Health Potion",
            "Scale Armor",
            "Steel Helmet",
            "Double Axe",
            "Magma Boots",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Enslaved_Dwarf",
        "name": "Enslaved Dwarf",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/3b/Enslaved_Dwarf.gif/revision/latest?cb=20120622171646&path-prefix=en",
        "attributes": {},
        "notes": "The Lost are some of the dwarfs that never joined one of the dwarven communities and aimlessly wandered the depths of the world in search of refuge. Sometimes in the ancient past they were found by 'those below' and cruelly enslaved by the masters of the depths. After generations of slavery and breeding, those dwarfs have lost all memory of their ancestry and culture, rendering them hardly more than aggressive animals of war. They lack a complicated language, communicating only with select gnarls and snarls. Their entire bitter lives are centred around battle and carnage. After their masters have completely broken their will, the Lost march in unquestioning obedience into battle whenever their cruel slavers order them to do so. It is hard to tell what motivation drives them. They seem not to revere to their masters in any way and show no joy in battle. The only emotion they are showing is incredible anger that rivals that of a rabid animal.",
        "abilities": [
            "Melee (0-500+)",
            "Throws boulder (340+)",
            "physical fire ball (3x3; 250+)",
            "Reduction bomb on itself; red sparkles (Reduces Shielding by 50-87%)",
            "Reduction explosion on itself; physical hit graphic (Reduces Melee by 66%)",
            "Green Sparkles (enhances its own melee skills?) Enslaved Dwarf",
            "Self Healing (physical hit graphic; 396-478+)",
            "drunkenness bomb (yellow sparks; on itself)"
        ],
        "resistance": [
            "Physical 103%",
            "Death 85%",
            "Holy 100%",
            "Ice 90%",
            "Fire 0%",
            "Energy 95%",
            "Earth 70%"
        ],
        "location": "Caves of the Lost, Lower Spike and Jaccus Maxxen's Dungeon.",
        "behaviour": "Unknown.An enslaved dwarf attacks in melee range.",
        "strategy": "A deadly creature for unprepared low level players, a blocker is probably to be preferred if these are to be hunted together with other Lost. An energy wall (or two energy walls in a cross shape) can be set up to make it walk longer distances and be easier to solo, but it may still do high damage from a distance. Beware of the drunkenness bomb if it gets too close, as well as other Lost (especially Bashers), that may interfere. Knights who decide to solo them should watch out for their skill reduction spells, which will reduce the Berserk hits to a joke. Keep an eye on your melee skill bar so you know when to cast an attack spell.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Brown Mushroom",
            "Great Health Potion",
            "Great Mana Potion",
            "Iron Ore",
            "Small Amethyst",
            "Small Emerald",
            "War Hammer",
            "Ancient Shield",
            "Drill Bolt",
            "Glorious Axe",
            "Brown Crystal Splinter",
            "Green Crystal Splinter",
            "Guardian Shield",
            "Red Crystal Fragment",
            "Shiny Stone",
            "Axe Ring",
            "Coal",
            "Green Crystal Shard",
            "Titan Axe",
            "Sapphire Hammer",
            "Tower Shield",
            "Warrior Helmet",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Lost_Basher",
        "name": "Lost Basher",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/58/Lost_Basher.gif/revision/latest?cb=20121125135323&path-prefix=en",
        "attributes": {},
        "notes": "In stark contrast to the silent and emotionless thrower, the Basher is bred to behave like a fierce animal. Their sounds and their berserk behaviour often give the impression to be fighting a kind of kongra in a dwarf's body. Though the basher employ a variety of killing utensils with frightening skill, those seem strangely out of place in their hands. Generally, they daunt their enemies with grunting noises and threatening posture, before charging and unleashing their full ferocity on the battlefield. Bashers are usually the first to charge into battle - as a matter of fact, the Bashers seem almost incapable of engaging into battle without a charge - accompanied by yells that cannot mistaken for ordinary battle cries. In combat, they continue their unnerving bawling and intimidating behaviour, although they frequently display a certain cunning and seem to enjoy slowly bleeding their enemies to death rather than swiftly finishing them off. Sometimes, however, they fly into an animal frenzy, dealing out a series of vicious and brutal blows that betray their immense strength. Moreover, the bashers seem to possess an uncanny sense of direction; and since both their mindset and their senses are animal-like, they are often used as guides, trackers or hunters by the Lost, although they are easily distracted.It is not uncommon for bands of Bashers to follow their prey like bloodhounds, chasing them to death, often without any assistance of other Lost. Whether they have been dispatched by some superiors or follow some kind of hunting urge is subject to speculation. Dwarfs who wander around on their own, for instance scouts of soldiers cut off from their units, frequently become subjects of such hunts. The few survivors tell horrible stories about being chased by the bloodthirsty packs and in most stories, only the fact that another victim distracted the bashers, saved the lives of the fugitive.",
        "abilities": [
            "Melee (0-350)",
            "3x3 physical bomb (80-220+)",
            "Drunkenness bomb (red sparkles)",
            "energy explosion (on itself; does haste)",
            "Self-Healing (250-500)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 85%",
            "Holy 100%",
            "Ice 100%",
            "Fire 75%",
            "Energy 95%",
            "Earth 0%"
        ],
        "location": "Caves of the Lost, Lower Spike and in the Lost Dwarf version of the Forsaken Mine Underground Glooth Factory",
        "behaviour": "Fights in close combat.A lost basher attacks in melee range.",
        "strategy": "Wear a Dwarven Ring to avoid the effect of its Drunkenness attack. While a single Lost Basher isn't much of a threat, they usually come in pack with other Losts, so be careful in areas where they are present.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Coal",
            "Bloody Dwarven Beard",
            "Lost Basher's Spike",
            "Brown Mushroom",
            "Great Mana Potion",
            "Red Hair Dye",
            "Wimp Tooth Chain",
            "Basalt Figurine",
            "Small Topaz",
            "Bonecarving Knife",
            "Ultimate Health Potion",
            "Basalt Fetish",
            "Bone Fetish",
            "Iron Ore",
            "Piggy Bank",
            "Black Shield",
            "Dwarven Ring",
            "Pair of Iron Fists",
            "Blue Crystal Shard",
            "Buckle",
            "Knight Axe",
            "Terra Boots",
            "Knight Legs",
            "Spiked Squelcher",
            "Fire Axe",
            "Chaos Mace",
            "War Axe",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Lost_Berserker",
        "name": "Lost Berserker",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/2/24/Lost_Berserker.gif/revision/latest?cb=20120622171742&path-prefix=en",
        "attributes": {},
        "notes": "If all Lost are somewhat deranged due to mental and physical abuse, the berserkers of the Lost are the worst of the lot. Insane to a degree that resembles rabies, they are all teeth and claws when attacking an enemy. Their masters often bind their weapons to their hands, since the lost beserkers tend to forget to use them in the heat of battle and often try to overpower their foes through clawing and biting. Gnomish troops that took enemy bases by surprise told stories that the lost beserkers are held in what resembles high security prisons chained in iron, deprived from sound and vision by leathery masks. More than other Lost they are focused on battle and carnage. Even other Lost, accustomed to injuries, wars and infighting tend to avoid them. Sometimes their bloodlust is so great that they begin to fight each other even in the midst of battle.",
        "abilities": [
            "Self-Healing (~650+) Lost Berserker",
            "Haste Lost Berserker",
            "Melee (0-500) Lost Berserker",
            "Reduction Bomb (Reduces Distance by 50-80%) Lost Berserker"
        ],
        "resistance": [
            "Physical 80%",
            "Death 85%",
            "Holy 100%",
            "Ice 90%",
            "Fire 90%",
            "Energy 100%",
            "Earth 0%"
        ],
        "location": "Warzones 2 and 3.",
        "behaviour": "A lost berserker attacks in melee range. A lost berserker never retreats.",
        "strategy": "Not recommended for knights to fight them alone, because they do mana drain. For all other vocations, use your strongest attacks to kill them. Energy walls and fire walls are useful here.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Brown Crystal Splinter",
            "Brown Mushroom",
            "Drill Bolt",
            "Great Health Potion",
            "Great Mana Potion",
            "Green Crystal Fragment",
            "Iron Ore",
            "Small Topaz",
            "Blue Crystal Splinter",
            "Coal",
            "Dwarven Ring",
            "Piggy Bank",
            "Violet Crystal Shard",
            "Black Shield",
            "Clay Lump",
            "Guardian Shield",
            "Knight Axe",
            "Chaos Mace",
            "Magic Sulphur",
            "Spiked Squelcher",
            "Terra Boots",
            "Tower Shield",
            "Fire Axe",
            "Royal Helmet",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Lost_Exile",
        "name": "Lost Exile",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/c/c2/Lost_Exile.gif/revision/latest?cb=20171109020906&path-prefix=en",
        "attributes": {},
        "abilities": [
            "Melee (0-200+)",
            "Death Strike (200-400)",
            "Death tar beam (150-350)",
            "Mana Drain Tar ball (150-250 on itself)",
            "Self-Healing (100-200+)",
            "Drunkenness bomb (red musical notes)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 80%",
            "Holy 110%",
            "Ice 85%",
            "Fire 75%",
            "Energy 90%",
            "Earth 0%"
        ],
        "location": "South east of the Gnome Deep Hub's entrance.",
        "behaviour": "Similar to Lost Husher, just stronger.A lost exile attacks from a distance.",
        "strategy": "To receive loot and experience from these creatures and at same time do task, it's recommended to lure them to the entrance and kill them there (at least those nearby spawns) or destroy a Makeshift Home and kill them far from other Makeshift Homes.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Wimp Tooth Chain",
            "Coal",
            "Strong Health Potion",
            "Brown Mushroom",
            "Holy Ash",
            "Red Hair Dye",
            "Basalt Fetish",
            "Small Topaz",
            "Bonecarving Knife",
            "Basalt Figurine",
            "Lost Husher's Staff",
            "Great Mana Potion",
            "Bone Fetish",
            "Skull Shatterer",
            "Dwarven Ring",
            "Guardian Shield",
            "Buckle",
            "Clay Lump",
            "Knight Axe",
            "Terra Boots",
            "Suspicious Device",
            "Tower Shield",
            "Terra Legs",
            "Fire Axe",
            "Skull Staff",
            "Spiked Squelcher",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Lost_Husher",
        "name": "Lost Husher",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/d2/Lost_Husher.gif/revision/latest?cb=20121125135152&path-prefix=en",
        "attributes": {},
        "notes": "The Husher is what comes closest to a magic-using shaman in the ranks of the Lost. Rather instinctively, and probably by having watched their ominous superiors working spells, they acquired some form of magic on their own. This led to a unique mixture of magic types which magic theorists would deem impossible, yet surprisingly enough yields results. Their magic is in no way subtle, and they probably regard it as some kind of divine wonder, rather than a product of their own actions. It is unknown whether Hushers are able to use more than the battle magic that has been observed. Given the nature of the Lost, it seems unlikely that they developed some other use of their mystical gifts, but as with so much else concerning the Lost, as they have only been encountered in battle and captives could not be reasoned with, little is known about their home and culture. Besides their magic, the Hushers are as wild and bloodthirsty as any other Lost, although some more planning and smartness can be attested to them. They are extremely resilient to pain, and part of their semi-religious acts seems to involve ritually cutting off their own skin, and scorching themselves with hot irons. Their simple religion seems centred on suffering and worship of everything that is associated with fire, heat and lava. For some reason, their magic bears an extreme affinity to smoke rather than fire itself. The intricacies of their belief system, if one exists at all, and how they teach each other their techniques, are still puzzling given the violent and animal behaviour of the Lost. It has to be assumed that somewhere in the depths of the earth where the Lost are bred, there is something like a Lost community with at least rudimentary structures, which allow them some kind of cultural identity and teaching of skills that go deeper than the mere animal-like drill which the fighting forces of the Lost seem to receive.",
        "abilities": [
            "Melee (?)",
            "Earth explosion (150-250+)",
            "Death tar beam (150-350)",
            "Death tar ball (on itself; 150-200+)",
            "Death Strike (150-200)",
            "Self-Healing (75-125+)",
            "Drunk Bomb (red musical notes)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 80%",
            "Holy 110%",
            "Ice 105%",
            "Fire 75%",
            "Energy 90%",
            "Earth 0%"
        ],
        "location": "Caves of the Lost, Lower Spike and in the Lost Dwarf version of the Forsaken Mine.",
        "behaviour": "A lost husher attacks from a distance.",
        "strategy": "Unknown.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Basalt Fetish",
            "Basalt Figurine",
            "Bone Fetish",
            "Bonecarving Knife",
            "Brown Mushroom",
            "Coal",
            "Great Mana Potion",
            "Holy Ash",
            "Lost Husher's Staff",
            "Red Hair Dye",
            "Skull Shatterer",
            "Small Topaz",
            "Strong Health Potion",
            "Wimp Tooth Chain",
            "Dwarven Ring",
            "Buckle",
            "Guardian Shield",
            "Knight Axe",
            "Terra Boots",
            "Clay Lump",
            "Fire Axe",
            "Skull Staff",
            "Spiked Squelcher",
            "Terra Legs",
            "Tower Shield",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Lost_Thrower",
        "name": "Lost Thrower",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/b/b3/Lost_Thrower.gif/revision/latest?cb=20121125135419&path-prefix=en",
        "attributes": {},
        "notes": "One of the most single-minded Lost yet encountered, the Thrower is often compared to some kind of insect by its dwarven enemies. The Thrower knows no fear, no mercy and no change of plans. It seems as if, once they have made up their minds or are herded to some aim, they are only to be stopped by death or by fulfilling their agenda. Though lacking the ferocity and aggression of their brethren, they share or even surpass their mercilessness, and their zombie-like dispassion forms an irritating contrast to the madness and bloodlust generally encountered in other Lost. The first assumption, that they were the raised dead of former battles, could be refuted, but the throwers seem to be completely broken in spirit and soul. It is pointless, however, to wonder whether they were broken for having a rebellious spirit, or if the raising in the slave pens do this to some of the Lost by default. The outcome is yet another killing machine at the disposal of the Lost hordes.Whereas other Lost bloodthirstily charge at the enemy ranks to engage them in close combat, the dispassionate Throwers are some of the few Lost to actually use long-distance weaponry, and use throwing axes to some efficiency. What they lack in precision they make up for in sheer force, and their thrown axes are known to bite sharp and go deep. Throwers often are part of the first wave of an attacking army of the Lost, but are also encountered in other fighting forces. Yet it is quite rare to encounter parties of Throwers on their own, and it seems that without the driving force of their brethrens' ferocity, they lack or forget any goal they might have had. They march and fight until complete and fatal exhaustion, ignoring their wounds and never leaving the battlefield, even if a combat had raged for hours or days on end. Where other Lost continue hitting a defeated foe in their frenzy, the thrower might do the same thing for the only reason that no one has told them to stop.  Also, it has occurred that without leadership or examples to follow, they stayed so intent on a given order that they completely ignored enemies whilst marching to a destination point even under heavy crossbow fire. While being one of the less dangerous of the Lost, the Thrower is by no means to be underestimated.",
        "abilities": [
            "Melee (0-300)",
            "red sparkle explosion on itself (Reduces Distance by 55%)",
            "3x3 physical bomb (150-300)",
            "Mana Drain Bomb (60-?)",
            "Drunkenness explosion",
            "Whirlwind Throw (150-250)",
            "Invisibility (very often)",
            "Self-Healing (100-500)"
        ],
        "resistance": [
            "Physical 90%",
            "Death 90%",
            "Holy 100%",
            "Ice 105%",
            "Fire 85%",
            "Energy 90%",
            "Earth 0%"
        ],
        "location": "Caves of the Lost, Lower Spike and in the Lost Dwarf version of the Forsaken Mine.",
        "behaviour": "A lost thrower attacks from a distance.",
        "strategy": "It is easy for a paladin to kill this, just keep distance and use assassin stars, prismatic bolts or crystalline arrows. For knights it is little harder to hunt them because you have to follow them. Level 100+ is recommended to kill these.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Basalt Fetish",
            "Basalt Figurine",
            "Bloody Dwarven Beard",
            "Broken Throwing Axe",
            "Brown Mushroom",
            "Coal",
            "Great Health Potion",
            "Great Mana Potion",
            "Iron Ore",
            "Lost Bracers",
            "Mad Froth",
            "Red Hair Dye",
            "Helmet of the Lost",
            "Buckle",
            "Loot Statistics"
        ]
    }
]