[
    {
        "url": "https://tibia.fandom.com/wiki/Angry_Sugar_Fairy",
        "name": "Angry Sugar Fairy",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/8/8b/Angry_Sugar_Fairy.gif/revision/latest?cb=20240604163352&path-prefix=en",
        "attributes": {},
        "notes": "Sugar fairies are delicate creatures consisting of sugar crystals, wearing colourful dresses made of marzipan and spun candy floss. They are seen as benevolent but prankful, bringing small amounts of delight to those who seek them out. Sugar fairies are typically a peaceful type of creature, preferring to spread positivity and joy around them. However, there are certain things that can make sugar fairies angry and upset. These include: Insults, disrespect, and rude behaviour towards them, desecration and destruction of sweet creations and delicacies as well as the presence of evil and malicious individuals or forces like Roshamuul nightmares.\nIf sugar fairies go underground, into the chocolate mines or gingerbread dungeons, they are often looking for ingredients or materials to use for their creations, which may be found only in these underground realms. These creations can vary greatly in size and complexity, depending on their purpose and desired effect. Intricate pieces of jewellery, figurines and ornaments are among them as well as charming and colourful dresses and apparel. You search for an elegant gown made entirely of candy floss, embroidered with sugary sprinkles? Tiny candy stars strung together on dainty chains to create a playful necklace? A chocolate coffee table or a soft peppermint cushion? The sugar fairies craft all of this artfully by hand and some of their creations can be bought at the Candy Carnival.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%",
            "Death 60%",
            "Holy 90%",
            "Ice 90%",
            "Fire 105%",
            "Energy 60%",
            "Earth 110%"
        ],
        "location": "Dessert Dungeons",
        "behaviour": "An angry sugar fairy attacks from a distance.",
        "loot": [
            "Platinum Coin",
            "Small Enchanted Emerald",
            "Small Enchanted Sapphire",
            "Wild Flowers",
            "Green Crystal Splinter",
            "Small Enchanted Ruby",
            "Violet Crystal Shard",
            "Wand of Cosmic Energy",
            "Ruby Necklace",
            "White Pearl",
            "Prismatic Quartz",
            "Wafer Paper Flower",
            "Ring of Healing",
            "Spellbook of Enlightenment",
            "Butterfly Ring",
            "Milk Chocolate Coin",
            "Hibiscus Dress",
            "Gold Nugget",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Arctic_Faun",
        "name": "Arctic Faun",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/38/Arctic_Faun.gif/revision/latest?cb=20180607130127&path-prefix=en",
        "attributes": {},
        "notes": "Arctic fauns are half-human, half-beast nature spirits. Just as their brethren they are strongly built with flat noses, large pointed ears, goats' legs and horns on their foreheads. However, they are inhabiting colder regions than the regular fauns and thus have white pelts rather than brown or black fur. Lately, some arctic fauns appeared outside of Feyrist on one of the small ice islands. They try to grow fresh grass and flowers in this snowy environment - with some success, as it seems. Yet, the reasons for their doings outside of Feyrist are unknown so far. As there are no arctic fauns on Feyrist, one can assume that they were somehow transformed - be it by environmental adaptation or by the power of dream magic. They are the cold-region relatives of regular Fauns.",
        "abilities": [
            "Melee (0-165)",
            "Self-Healing (45-55)",
            "Haste"
        ],
        "resistance": [
            "Physical 90%",
            "Death 80%",
            "Holy 70%",
            "Ice 20%",
            "Fire 115%",
            "Energy 110%",
            "Earth 30%"
        ],
        "location": "Arctic Faun's Island.",
        "behaviour": "Fights in melee range. Often combo their regular attack with both kind of snowballs. Can combo well over 200 if they are in melee range and use both snowballs at once.An arctic faun attacks in melee range. An arctic faun never retreats.",
        "strategy": "They are frail and somewhat slow. Kite them if you are a mage or paladin and keep your distance to avoid taking damage.",
        "loot": [
            "Gold Coin",
            "Strong Health Potion",
            "Cookie",
            "Goat Grass",
            "Fresh Fruit",
            "Shimmering Beetles",
            "Dandelion Seeds",
            "Leaf Star",
            "Great Health Potion",
            "Small Stone",
            "Panpipes",
            "Grapes",
            "Rainbow Quartz",
            "Wood Cape",
            "Leaf Legs",
            "Wooden Spellbook",
            "Die",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Boogy",
        "name": "Boogy",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/34/Boogy.gif/revision/latest?cb=20170728175757&path-prefix=en",
        "attributes": {},
        "notes": "Boogies are a rather twisted kind of fae. They have a chubby body covered in shaggy fur, a tasseled tail, short legs and very long, clawed arms that are almost touching the floor. Their maw is huge compared to their body and a spiky, menacing horn protrudes from their foreheads. Other than pixies, nymphs or fauns they favour underground caves and tunnels over forests or lush meadows. Only at night, they are roaming the surface, chasing other fae and visitors to Feyrist alike. Boogies devour smaller animals like squirrels, rabbits or badgers but on the quiet the fae tell that they also feed on fairies or pookas if they catch them. As the fae emerge from mortals' pleasant dreams the boogies don't really fit into the mould. In fact they were once clumsy yet peaceful fae, but they are now twisted and tainted by a mysterious, sinister force that is threatening Feyrist as well as the rest of Tibia. Boogies initially emerged from mortals' dreams about tasty food.",
        "abilities": [
            "Melee (0-465)",
            "Blood Ball (115 hit +5 bleeding) Boogy",
            "Rock Strike Boogy",
            "Large Stone Strike Boogy",
            "Haste",
            "Self-Healing (40-120)"
        ],
        "resistance": [
            "Physical 90%",
            "Death 80%",
            "Holy 60%",
            "Ice 90%",
            "Fire 100%",
            "Energy 100%",
            "Earth 30%"
        ],
        "location": "Feyrist (night time) and its underground (all day)",
        "behaviour": "A boogy attacks in melee range. A boogy never retreats.",
        "loot": [
            "Gold Coin",
            "Shimmering Beetles",
            "Strong Health Potion",
            "Fairy Wings",
            "Leaf Star",
            "Wood Mushroom",
            "Prismatic Quartz",
            "Red Crystal Fragment",
            "Sling Herb",
            "Small Enchanted Emerald",
            "Ancient Coin",
            "Terra Amulet",
            "Berserk Potion",
            "Golden Sickle",
            "Wooden Spellbook",
            "Mandrake",
            "Crystal of Power",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Candy_Horror",
        "name": "Candy Horror",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/1/18/Candy_Horror.gif/revision/latest?cb=20240604125609&path-prefix=en",
        "attributes": {},
        "notes": "Just like Feyrist, Candia is not completely immune to the invasion of nightmare monsters from neighboring Roshamuul. However, unlike in Feyrist, the nightmares do not arrive in Candia unchanged: they have transformed and are now made entirely of sweets.\nIf retching horrors get from Roshamuul to Candia, they are changed into candy horrors. Their bulky bodies transform into solid chocolate dough, their spikes into raked cream meringue and candy canes grow where their horns once were. Candy horrors can also tear out these candy canes and throw them at their victims. They don't have to worry about losing them, though, because the candy canes grow back extremely quickly.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 95%",
            "Death 50%",
            "Holy 115%",
            "Ice 100%",
            "Fire 95%",
            "Energy 110%",
            "Earth 90%"
        ],
        "location": "Chocolate Mines",
        "behaviour": "A candy horror attacks in melee range. A candy horror never retreats.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Giant Shimmering Pearl",
            "Red Gem",
            "Energy Bar",
            "Violet Gem",
            "Wand of Decay",
            "Black Shield",
            "Strawberry",
            "Gummy Rotworm",
            "Brigadeiro",
            "Dreaded Cleaver",
            "Dark Chocolate Coin",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Dark_Faun",
        "name": "Dark Faun",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/3/3c/Dark_Faun.gif/revision/latest?cb=20171020182535&path-prefix=en",
        "attributes": {},
        "notes": "Dark Fauns are stronger and more aggressive than common Fauns. They live underground and only show up on the surface during the night.",
        "abilities": [
            "Melee (0-450)",
            "Earth Strike (76-105) Dark Faun",
            "throws Leaf Stars (0-115) Dark Faun",
            "Purple Notes Wave (causes drunkenness for 5 seconds) Dark Faun",
            "Self-Healing (80-115)",
            "Haste",
            "Green Note (unknown) Dark Faun"
        ],
        "resistance": [
            "Physical 90%",
            "Death 60%",
            "Holy 110%",
            "Ice 100%",
            "Fire 105%",
            "Energy 110%",
            "Earth 30%"
        ],
        "location": "Feyrist (nighttime) and its underground (all day).",
        "behaviour": "A dark faun attacks in melee range. A dark faun never retreats.",
        "strategy": "Avoid its melee hit, which is a Dark Faun's strongest attack and can easily combo a level 200 mage if more than one is present.",
        "loot": [
            "Gold Coin",
            "Strong Health Potion",
            "Goat Grass",
            "Cave Turnip",
            "Shimmering Beetles",
            "Fairy Wings",
            "Leaf Star",
            "Great Health Potion",
            "Small Enchanted Sapphire",
            "Small Stone",
            "Panpipes",
            "Wood Cape",
            "Dark Mushroom",
            "Prismatic Quartz",
            "Leaf Legs",
            "Mandrake",
            "Die",
            "Wooden Spellbook",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Faun",
        "name": "Faun",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/a/a6/Faun.gif/revision/latest?cb=20171020182911&path-prefix=en",
        "attributes": {},
        "notes": "The fauns are half-human, half-beast nature spirits inhabiting the woods and mountains of Feyrist. They are strongly built with flat noses, large pointed ears, goats' legs and horns on their foreheads. Fauns are a slightly roguish but cheerful folk, lovers of wine and dancing, roaming to the music of panpipes, cymbals, castanets and bagpipes, dancing with the nymphs and swan maidens. Wreaths of vine or ivy often circle their heads. Sometimes they drape themselves with cloth, sometimes also with fawn skins. These children of nature show a youthful and graceful aspect but they are also brave and fearless when it comes to defend themselves. In this case, they display the brutal instincts necessary to survive that every creature of the wild possesses. Fauns emerge from mortals' dreams about celebrations, music and dancing.Lately, some fauns on Feyrist are tainted by a mysterious, sinister force that is threatening Feyrist as well as the rest of Tibia. They were transformed into dark fauns who are chasing their brethren and visitors to the fae realm alike. They say (translated from latin) \"In wine there is truth\".",
        "abilities": [
            "Melee (0-360)",
            "Earth Strike (60-80) Faun",
            "throws Leaf Stars (0-100) Faun",
            "Purple Notes Wave (causes drunkenness for 5 seconds) Faun",
            "Self-Healing (80-90)",
            "Haste"
        ],
        "resistance": [
            "Physical 90%",
            "Death 80%",
            "Holy 70%",
            "Ice 100%",
            "Fire 115%",
            "Energy 110%",
            "Earth 30%"
        ],
        "location": "Feyrist (daytime).",
        "behaviour": "Fights in melee range. Often combo their regular attack with stalagmites. Can combo well over 400 if they are in melee range.A faun attacks in melee range. A faun will retreat at 60  (6.67%, red) health.",
        "strategy": "Mages: Wear dwarven ring as their drunkness wave could easily prove fatal. Fauns deal more damage than a giant spider in both melee and magic damage.\nFirewalls and Firebombs enable to hunt these on small areas without luring more fae.",
        "loot": [
            "Gold Coin",
            "Dandelion Seeds",
            "Strong Health Potion",
            "Goat Grass",
            "Shimmering Beetles",
            "Fresh Fruit",
            "Leaf Star",
            "Cookie",
            "Panpipes",
            "Rainbow Quartz",
            "Grapes",
            "Small Stone",
            "Small Enchanted Sapphire",
            "Great Health Potion",
            "Wood Cape",
            "Leaf Legs",
            "Wooden Spellbook",
            "Die",
            "Mandrake",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Memory_of_a_Faun",
        "name": "Memory of a Faun",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/1/1b/Memory_of_a_Faun.gif/revision/latest?cb=20220108230139&path-prefix=en",
        "attributes": {},
        "notes": "It's a weakened Dark Faun.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 100%?",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Time Travel Dungeon",
        "behaviour": "A memory of a faun attacks in melee range.",
        "loot": [
            "Cave Turnip",
            "Panpipes",
            "Small Enchanted Sapphire",
            "Strong Health Potion",
            "Great Health Potion",
            "Small Stone",
            "Special Fx Box",
            "Bottle of Champagne",
            "Gold Coin",
            "Dark Mushroom",
            "Prismatic Quartz",
            "Goat Grass",
            "Candy Floss (Large)",
            "Mandrake",
            "Die",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Nibblemaw",
        "name": "Nibblemaw",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/a/aa/Nibblemaw.gif/revision/latest?cb=20240604163422&path-prefix=en",
        "attributes": {},
        "notes": "Just like Feyrist, Candia is not completely immune to the invasion of nightmare monsters from neighboring Roshamuul. However, unlike in Feyrist, the nightmares do not arrive in Candia unchanged: they have transformed and are now made entirely of sweets.\nWhen guzzlemaws or frazzlemaws arrive in Candia, they are transformed into giant balls of peppermint with teeth made of the hardest chocolate imaginable. Their thick sugar coating makes them highly resistant to weapon attacks. This sweet transformation may make them look rather cute, but don't be fooled: They are still dangerous predators who prey on the more peaceful inhabitants of Candia. They seem to particularly like the industrious little workers in the chocolate mines, so they pose a serious threat to Candia's chocolate supply and are always a thorn in the side of the Sugar Plum Fairy.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 90%",
            "Death 60%",
            "Holy 110%",
            "Ice 100%",
            "Fire 100%",
            "Energy 115%",
            "Earth 90%"
        ],
        "location": "Chocolate Mines",
        "behaviour": "A nibblemaw attacks in melee range. A nibblemaw never retreats.",
        "loot": [
            "Strong Health Potion",
            "Gold Coin",
            "Platinum Coin",
            "Yellow Gem",
            "Frazzle Tongue",
            "Frazzle Skin",
            "Onyx Chip",
            "Melon",
            "Red Crystal Fragment",
            "Gummy Rotworm",
            "Lime Tart",
            "Raspberry",
            "Assassin Dagger",
            "Dark Chocolate Coin",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Nymph",
        "name": "Nymph",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/05/Nymph.gif/revision/latest?cb=20170728174952&path-prefix=en",
        "attributes": {},
        "notes": "Nymphs are female nature spirits and usually take the form of beautiful, young maidens who love to dance and sing. They dwell in the hills and forests of Feyrist, often near lakes and streams and they can't die of old age nor illness. On Feyrist, nymphs can be encountered by lone travelers where their music might be heard, and the traveler could spy on their dancing or bathing in a stream or pool. Such encounters could be dangerous, though, as nymphs generally dislike to be stalked. These fae have a special, strong bond to the plants and animals of their domain and are very protective of Feyrist's flora and fauna. Nymphs emerge from mortals' dreams about love.",
        "abilities": [
            "Melee (0-180)",
            "Heavy Magic Missile (85-135) Nymph",
            "Hearts Strike Nymph",
            "Self-Healing (75-105)",
            "unknown Green Notes Effect"
        ],
        "resistance": [
            "Physical 110%",
            "Death 60%",
            "Holy 60%",
            "Ice 100%",
            "Fire 100%",
            "Energy 100%",
            "Earth 40%"
        ],
        "location": "Feyrist",
        "behaviour": "UnknownA nymph attacks in melee range.",
        "strategy": "Unknown",
        "loot": [
            "Gold Coin",
            "Wild Flowers",
            "Fresh Fruit",
            "Colourful Snail Shell",
            "Dandelion Seeds",
            "Great Mana Potion",
            "Small Topaz",
            "Small Enchanted Amethyst",
            "Emerald Bangle",
            "Sacred Tree Amulet",
            "Butterfly Ring",
            "Strong Mana Potion",
            "Dream Blossom Staff",
            "Flower Wreath",
            "Hibiscus Dress",
            "Blue Rose",
            "Boots of Haste",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Pixie",
        "name": "Pixie",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/1/1c/Pixie.gif/revision/latest?cb=20171013214939&path-prefix=en",
        "attributes": {},
        "notes": "Pixies are small nature spirits and mythical creatures inhabiting the forests and plains of Feyrist. They are generally benign, but at times, they may also display mischievous traits. Like most of the fae, pixies love dancing and are often gathering in larger groups to dance on secluded glades. Pixies are rather small, reaching about the height of a very young human child. They have pointed ears, colourful hair and fragile butterfly or dragonfly wings. These wings give them the ability to fly and a pixie's feet rarely touch the ground. Their clothing consists of fresh leaves and flower petals. Pixies love flowers, butterflies, shimmering beetles, gems and other colourful things as well as the taste of honey, sweetened oat and ripe grapes. Pixies emerge from mortals' dreams about friends and family.",
        "abilities": [
            "Melee (0-100)",
            "Energy Strike (70-96) Pixie",
            "Green Sparkle Wave ( paralyses you for a few seconds) Pixie",
            "Purple cloud explosion on itself (Reduces Melee and Distance and Shielding by 70% for 3~ seconds) Pixie",
            "Self-Healing (45-75)"
        ],
        "resistance": [
            "Physical 105%",
            "Death 70%",
            "Holy 40%",
            "Ice 105%",
            "Fire 110%",
            "Energy 100%",
            "Earth 40%"
        ],
        "location": "Feyrist",
        "behaviour": "They keep a distance of about 4 fields.A pixie attacks from a distance. A pixie will retreat at 30  (3.9%, deep red) health.",
        "strategy": "Knights: Try to trap them somewhere, as their skill reduction and paralysis combined with the distance they keep can make for a long fight where you risk luring and being surrounded by other Feyrist creatures.",
        "loot": [
            "Gold Coin",
            "Wild Flowers",
            "Dandelion Seeds",
            "Fresh Fruit",
            "Colourful Snail Shell",
            "Leaf Star",
            "Star Herb",
            "Magic Light Wand",
            "Great Mana Potion",
            "Red Rose",
            "Rainbow Quartz",
            "Small Enchanted Amethyst",
            "Green Mushroom",
            "Strong Mana Potion",
            "Dream Blossom Staff",
            "Butterfly Ring",
            "Wooden Spellbook",
            "Small Topaz",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Pooka",
        "name": "Pooka",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/50/Pooka.gif/revision/latest?cb=20170728180659&path-prefix=en",
        "attributes": {},
        "notes": "Pookas are nature spirits in animal form, looking like big hares with a faintly glittering fur. They are benign but mischievous, for sure with good reason regarded as the tricksters among the fae. Pookas love to play pranks on others, snitching and hiding things or telling made-up stories. If a traveller talks to a pooka, it may steal something from him or transform him into another creature temporarily. Yet, it is as likely that the pooka offers a present or grants an useful spell. Pookas are capricious and fickle creatures. They can also take the form of human children and as such they often try to fool visitors to Feyrist. However, their human shape includes various animal features, such as ears or a tail. The transformed pooka will try to hide these traits, but observant travelers can tell there is something going on. Pookas emerge from mortals' dreams about gems, treasures and gold.Lately, some pookas on Feyrist are tainted by a mysterious, sinister force that is threatening Feyrist as well as the rest of Tibia. They were transformed into twisted pookas who are chasing their brethren and playing tricks that are outright wicked rather than just prankful.",
        "abilities": [
            "Melee (0-120)",
            "throws Small Stones (0-100) Pooka",
            "Star Wave (?) Pooka",
            "Shapeshifting (Turns victims into; Skunk ) Pooka",
            "Self-Healing (40-60)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 90%",
            "Holy 80%",
            "Ice 80%",
            "Fire 80%",
            "Energy 110%",
            "Earth 30%"
        ],
        "location": "Feyrist (daytime)",
        "behaviour": "A pooka attacks in melee range. A pooka will retreat at 30  (6%, red) health.",
        "strategy": "Unknown",
        "loot": [
            "Gold Coin",
            "Carrot",
            "Shimmering Beetles",
            "Rainbow Quartz",
            "Small Stone",
            "Orange Mushroom",
            "Small Enchanted Ruby",
            "Dream Blossom Staff",
            "Fern",
            "Cookie",
            "Opal",
            "Strong Health Potion",
            "Carrot on a Stick",
            "Stealth Ring",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Sugar_Cube",
        "name": "Sugar Cube",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/7d/Sugar_Cube.gif/revision/latest?cb=20240604125207&path-prefix=en",
        "attributes": {},
        "notes": "The small living sugar cubes of Candia are delicate creatures fashioned entirely out of sugar crystals. Some roam carefree across the sweet, colourful surface of their world, but many also work in the underground chocolate mines. Industrious but sometimes clumsy, the sugar cubes mine the raw, unrefined chocolate and refine it into creamy, delicious goodness. They mix it with other ingredients, use machinery and tools to shape it, and package it for storage and distribution. The sugar cubes are known for being diligent and hardworking, but often clumsy due to their rectangular shape. Sometimes they fall into milk or cacao lakes and need help getting out. They also can be very talkative and prone to getting distracted while working. But apart from that, they are definitely the force that keeps Candia's chocolate production going.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%",
            "Death 100%",
            "Holy 100%",
            "Ice 95%",
            "Fire 110%",
            "Energy 110%",
            "Earth 80%"
        ],
        "location": "Candia",
        "behaviour": "A sugar cube does not attack.",
        "loot": [
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Swan_Maiden",
        "name": "Swan Maiden",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/03/Swan_Maiden.gif/revision/latest?cb=20170729194655&path-prefix=en",
        "attributes": {},
        "notes": "Swan maidens are a kind of fae who can shapeshift from a young elven or human female into a beautiful swan. The magical item allowing this transformation is a swan feather cloak, a garment with swan feathers attached. If this cloak is taken from a swan maiden, she is stuck in the shape she had at the time of the theft. She will only be able to shapeshift again when she regains her cloak. On Feyrist it is always hard to tell whether a swan swimming on a lake is an ordinary animal or a swan maiden in her bird shape. Swan maidens protect the wilds of their secret realm from intruders and live in small flocks along secluded lakeshores. It is told that a swan maiden can transform a willing human or elven virgin into a swan maiden herself. Swan maidens emerge from mortals' dreams about flying.",
        "abilities": [
            "Melee (0-160)",
            "Energy Strike (83-105) Swan Maiden",
            "Mana Drain (82-119) Swan Maiden",
            "Sparkle Ball on themselves (causes paralysis for a few seconds) Swan Maiden",
            "Self-Healing (62-78)",
            "unknown Blue Notes Effect"
        ],
        "resistance": [
            "Physical 110%",
            "Death 50%",
            "Holy 70%",
            "Ice 100%",
            "Fire 110%",
            "Energy 100%",
            "Earth 70%"
        ],
        "location": "Feyrist Meadows",
        "behaviour": "Swan Maidens try to attack their opponents at a distance using their spells.A swan maiden attacks from a distance. A swan maiden will retreat at 40  (5%, red) health.",
        "strategy": "Wearing a Bronze Amulet could be a good idea in order to counter their commonly used mana drain attack. Otherwise they're not that strong and your biggest worry should be running into groups of other Feyrist creatures while chasing them.",
        "loot": [
            "Gold Coin",
            "Wild Flowers",
            "Colourful Snail Shell",
            "Powder Herb",
            "White Pearl",
            "Silver Brooch",
            "Great Mana Potion",
            "Green Mushroom",
            "Small Enchanted Emerald",
            "Coral Brooch",
            "Opal",
            "Clerical Mace",
            "Flower Wreath",
            "Boots of Haste",
            "Summer Dress",
            "Strong Mana Potion",
            "Butterfly Ring",
            "Diamond Sceptre",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Twisted_Pooka",
        "name": "Twisted Pooka",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/b/b0/Twisted_Pooka.gif/revision/latest?cb=20170728180952&path-prefix=en",
        "attributes": {},
        "notes": "Twisted Pookas are stronger and more aggressive than Pookas.",
        "abilities": [
            "Melee (0-180 and starting up to 8 hp/turn)",
            "throws Small Stones (0-100) Twisted Pooka",
            "Star Wave (causes drunkenness for 5 seconds) Twisted Pooka",
            "Self-Healing (40-60)"
        ],
        "resistance": [
            "Physical 80%",
            "Death 70%",
            "Holy 120%",
            "Ice 80%",
            "Fire 80%",
            "Energy 110%",
            "Earth 60%"
        ],
        "location": "Feyrist (nighttime) and its underground (all day).",
        "behaviour": "A twisted pooka attacks in melee range. A twisted pooka never retreats.",
        "strategy": "Unknown",
        "loot": [
            "Gold Coin",
            "Strong Health Potion",
            "Carrot",
            "Stone Herb",
            "Shimmering Beetles",
            "Fairy Wings",
            "Small Enchanted Ruby",
            "Small Stone",
            "Cookie",
            "Orange Mushroom",
            "Prismatic Quartz",
            "Stealth Ring",
            "Carrot on a Stick",
            "Crystal of Focus",
            "Loot Statistics"
        ]
    }
]