[
    {
        "url": "https://tibia.fandom.com/wiki/Gravedigger",
        "name": "Gravedigger",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/d9/Gravedigger.gif/revision/latest?cb=20140215170309&path-prefix=en",
        "attributes": {},
        "notes": "The gravediggers are, in apparition, akin to the cursed hands of fate, and share some aspects of their character. The gravediggers are undead creatures that have first been sighted near the necromancer sites in Drefia, where they have at first been employed for strenuous handiworks such as digging and building up the underground ruins of Drefia. Some speculate that the hands were chopped off live subjects and then enhanced through hideous rituals and processes to take their actual, ghastly form. However, the beasts proved to have a will of their own and soon broke free from their masters' grip, and some still roam the premises like other undead. They are solitary creatures and quite aggressive, but a few cases have been reported where humans made friends with a gravedigger, which lasted a lifetime.",
        "abilities": [
            "Melee (0-320? and starting up to 7 hp/turn)",
            "Invisibility",
            "Mana Drain (40-250; melee range only)",
            "strong Self-Healing",
            "Strong Haste",
            "large Death Ball on self ( Drunkenness )",
            "Melee Death Hit (175-300?)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 0%",
            "Holy 105%",
            "Ice 0%",
            "Fire 110%",
            "Energy 0%",
            "Earth 105%"
        ],
        "location": "Around the higher level areas of Drefia, including the Drefia Grim Reaper Dungeons and the Drefia Vampire Crypt.",
        "behaviour": "They fight in close range and run on deep red health.A gravedigger attacks in melee range.",
        "strategy": "Be prepared to frequently cast spells or area runes as they often go invisible. If it appears with other creatures, it is recommended to focus on the Gravedigger first as the mana drain is quite annoying. Tip for knights, you could use the spell Inflict Wound on them, this will turn them visible.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Unholy Bone",
            "Pile of Grave Earth",
            "Safety Pin",
            "Sudden Death Rune",
            "Wand of Inferno",
            "Strong Mana Potion",
            "Strong Health Potion",
            "Death Ring",
            "Yellow Gem",
            "Mysterious Voodoo Skull",
            "Skull Staff",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Hand_of_Cursed_Fate",
        "name": "Hand of Cursed Fate",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/4/45/Hand_of_Cursed_Fate.gif/revision/latest?cb=20180707104432&path-prefix=en",
        "attributes": {},
        "notes": "It is unknown to mankind whether this hand is some pure materialisation of demonic essence or actually a body part of a greater evil. It is sure though that its existence is fuelled by powerful demonic forces. Living or animated, it is a fast and powerful minion in the demonic ranks. Yet obviously lacking a head, the creature is quite cunning and loves dirty surprise attacks. It usually attacks with individual fingers, but it is also said that the Hand of Cursed Fate sometimes grasps an opponent to crush it in its powerful grip. Its greatest pleasure is to bring pain and despair to others. Above all it enjoys the suffering of creatures. The Hand of Cursed Fate is attracted by those whom it senses as doomed and takes greatest amusement in their demise. Therefore it is a powerful adversary, and it is no mockery when it is claimed that the Hand of Cursed Fate can pull some dirty tricks out of its sleeve. It's the first creature known to drop a non-blank rune.",
        "abilities": [
            "Melee (0-520 and starting up to 19 hp/turn)",
            "Mana Drain (?)",
            "Death Strike (0-880+)",
            "Invisibility",
            "Strong Haste",
            "Self-Healing (?)",
            "causes Drunkenness"
        ],
        "resistance": [
            "Physical 100%",
            "Death 0%",
            "Holy 125%",
            "Ice 110%",
            "Fire 0%",
            "Energy 95%",
            "Earth 0%"
        ],
        "location": "Pits of Inferno, The Battlefield, The Arcanum, The Blood Halls, The Crystal Caves and Grounds of Despair.",
        "behaviour": "A cowardly creature that retreats early upon being damaged and often goes invisible.A hand of cursed fate attacks in melee range. A hand of cursed fate will retreat at 2000  (30.3%, yellow) health.",
        "strategy": "Since it has no ranged damaging attack, it is a good idea to have a Knight blocking it and as many shooters as possible. This may be tricky though since it can disappear, and you have to find it with Runes. So, that Knight must try to lure it in a place where it can't move, and then spam it with Ice and Holy-Based Spells. Note though that when using Haste, the creature can become extremely fast, about the speed of a level 650+ so don't expect to chase it until it has slowed down. Try to trap the creature with a Knight blocker and possibly some Wild Growths.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Soul Orb",
            "Flask of Demonic Blood",
            "Great Mana Potion",
            "Ultimate Health Potion",
            "Mind Stone",
            "Assassin Star",
            "Small Sapphire",
            "Demonic Essence",
            "Protection Amulet",
            "Yellow Gem",
            "Emerald Bangle",
            "Wand of Inferno",
            "Sudden Death Rune",
            "Knight Armor",
            "Energy Ring",
            "Blue Gem",
            "Death Ring",
            "Crown Armor",
            "Platinum Amulet",
            "Skull Staff",
            "Violet Gem",
            "Book (Orange)",
            "Gold Ingot",
            "Boots of Haste",
            "Mysterious Voodoo Skull",
            "Abyss Hammer",
            "Loot Statistics"
        ]
    }
]