[
    {
        "url": "https://tibia.fandom.com/wiki/Depowered_Minotaur",
        "name": "Depowered Minotaur",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/7/7a/Depowered_Minotaur.gif/revision/latest?cb=20141127071448&path-prefix=en",
        "attributes": {},
        "notes": "It's the weakened version of the Glooth Powered Minotaur.",
        "abilities": [
            "Melee (0-200+)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 90%",
            "Ice 100%?",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Second floor Glooth Underground Factory, east side during a minotaur raid.",
        "behaviour": "Fights in close combat. A depowered minotaur never retreats.",
        "strategy": "Once they are in this form, they can be easily killed since it's weaker than the other minotaurs.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Small Sapphire",
            "Strong Mana Potion",
            "Strong Health Potion",
            "Minotaur Leather",
            "Small Diamond",
            "Meat",
            "Minotaur Horn",
            "Small Ruby",
            "Small Sapphire",
            "Small Emerald",
            "Mooh'tah Plate",
            "Club Ring",
            "Red Piece of Cloth",
            "Minotaur Trophy",
            "Spiked Squelcher",
            "Cowtana",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Archer",
        "name": "Minotaur Archer",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/9d/Minotaur_Archer.gif/revision/latest?cb=20150416140717&path-prefix=en",
        "attributes": {},
        "notes": "Minotaur Archers form the artillery of the minotaurs' army. Using their crossbows they shoot bolts at their enemies. Many adventurers have died in the hail of missiles. Usually, they are accompanied by other types of minotaurs. A powerful minotaur. Popular to Summon as it is almost as deadly as a Fire Devil and requires less mana. These creatures can be skinned with an Obsidian Knife. See also: Minotaur Leather/Skinning.",
        "abilities": [
            "Melee (0-25)",
            "Shoots bolts (0-80) Minotaur Archer"
        ],
        "resistance": [
            "Physical 100%",
            "Death 105%",
            "Holy 90%",
            "Ice 110%",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Ancient Temple, way to Mintwallin, Folda Underground Cave, Outlaw Camp, Plains of Havoc, Kazordoon Minotaur Tower, Daramian Minotaur Pyramid, Deeper Fibula Dungeon (level 50+ to open the door), Hero Cave, Foreigner Quarter and Elvenbane.",
        "behaviour": "Attacks from a distance.A minotaur archer attacks from a distance. A minotaur archer will retreat at 4 to 29 (4% - 29%, red) health.",
        "strategy": "Run towards them and don't let him attack from a distance. Usually in company of Minotaur Guards and Minotaur Mages.\nBe careful, as this creature is strong and can kill an inexperienced player pretty quickly. Stealth Rings can be a big help when facing many of these.",
        "loot": [
            "Gold Coin",
            "Bolt",
            "Broken Crossbow",
            "Piece of Archer Armor",
            "Piercing Bolt",
            "Meat",
            "Minotaur Horn",
            "Minotaur Leather",
            "Brass Armor",
            "Crossbow",
            "Scale Armor",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Bruiser",
        "name": "Minotaur Bruiser",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/57/Minotaur_Bruiser.gif/revision/latest?cb=20141110210602&path-prefix=en",
        "attributes": {},
        "notes": "A weaker Minotaur. Created for Dawnport to introduce new players to the game. Minotaur Bruisers come in groups with other Minotaurs (Poachers, Occultists, and Minotaurs), as well as Wasps, and Poison Spiders. Care must be taken because the magi of their kind, Occultists, are very strong in comparison.",
        "abilities": [
            "Melee (0-45)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Dawnport Crystal Dungeon, all floors.",
        "behaviour": "Unknown",
        "strategy": "Unknown",
        "loot": [
            "Gold Coin",
            "Plate Shield",
            "Studded Armor",
            "Axe",
            "Mace",
            "Sword",
            "Brass Helmet",
            "Chain Armor",
            "Meat",
            "Shovel",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Guard",
        "name": "Minotaur Guard",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/e9/Minotaur_Guard.gif/revision/latest?cb=20210420144704&path-prefix=en",
        "attributes": {},
        "notes": "Minotaur Guards form the heavy troops of the minotaurs' army. They are tough short-range fighters but vulnerable by distance fighting weapons. Watch out for archers that are usually placed in the second row behind them. Besides the bosses, Minotaur Guards have the strongest melee of the classic Minotaurs. These creatures can be skinned with an Obsidian Knife. See also: Minotaur Leather/Skinning.",
        "abilities": [
            "Melee (0-100)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 110%",
            "Holy 90%",
            "Ice 110%",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Ancient Temple, Mintwallin, Minotaur Pyramid, Maze of Lost Souls, Folda, Cyclopolis, Deeper Fibula Dungeon (level 50+ to open the door), Hero Cave, underground of Elvenbane, Plains of Havoc, Kazordoon Minotaur Cave, Foreigner Quarter.",
        "behaviour": "Minotaur Guards will kill weaker creatures to reach a player. They can also retarget.A minotaur guard attacks in melee range. A minotaur guard never retreats.",
        "strategy": "Knights: should have good skills (over 55/55) and decent equipment to kill one of these. Minotaur Guards may be accompanied with Minotaur Archers and Minotaur Mages.\nPaladins: can just attack them and try to avoid melee hits. It's really easy to outrun them while shooting Arrows, Bolts and Spears.\nMages: can use Invisible and then attack them with Runes or just running and shooting. Using a Rod or Wand is also as effective and saves runes. If your Level is a little higher, you can also combine a wand or rod with Ice Strike. You should have fairly good equipment.",
        "loot": [
            "Gold Coin",
            "Minotaur Horn",
            "Battle Shield",
            "Piece of Warrior Armor",
            "Brass Armor",
            "Chain Armor",
            "Fishing Rod",
            "Minotaur Leather",
            "Double Axe",
            "Health Potion",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Invader",
        "name": "Minotaur Invader",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/6/61/Minotaur_Invader.gif/revision/latest?cb=20210420151852&path-prefix=en",
        "attributes": {},
        "notes": "When the enemy wall has been breached, the Minotaur Invader's role begins. Many of these will spawn all over the east side of the Glooth Underground Factory, second floor, in many waves throughout the hour.",
        "abilities": [
            "Melee (0-350+)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 110%",
            "Holy 90%",
            "Ice 110%",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Second floor Glooth Underground Factory, east side during the Minotaurs raid.",
        "behaviour": "Fights in close combat similar to an Execowtioner.A minotaur invader attacks in melee range. A minotaur invader never retreats.",
        "strategy": "Just kill them, they are similar to Execowtioners but weaker. Watch out for Glooth Powered Minotaurs, which cannot be killed unless you lure them to special Glooth Extractors, and for Minotaur Totems, which heal all creatures around it.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Piece of Warrior Armor",
            "Minotaur Horn",
            "Minotaur Leather",
            "Small Topaz",
            "Small Ruby",
            "Small Amethyst",
            "Guardian Shield",
            "Knight Axe",
            "Mooh'tah Plate",
            "Blue Piece of Cloth",
            "Red Piece of Cloth",
            "Warrior Helmet",
            "Red Gem",
            "Blue Gem",
            "Titan Axe",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Mage",
        "name": "Minotaur Mage",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/f/f6/Minotaur_Mage.gif/revision/latest?cb=20141110205457&path-prefix=en",
        "attributes": {},
        "notes": "Minotaur Mages are the elite of the minotaurs' army. With their magic they support the other troops in a fight. They can create energy fields and shoot fireballs or magic missiles.  As they are weak short-range fighters, guards will protect them while they operate from the second row. These creatures are dangerous and usually found with Minotaur Guards because of their low defense. These creatures can be skinned with an Obsidian Knife. See also: Minotaur Leather/Skinning.",
        "abilities": [
            "Melee (0-21)",
            "Energy Strike (15-45) Minotaur Mage",
            "Fire Strike (35-95) Minotaur Mage",
            "Creates Energy Fields Minotaur Mage"
        ],
        "resistance": [
            "Physical 100%",
            "Death 105%",
            "Holy 90%",
            "Ice 110%",
            "Fire 100%",
            "Energy 80%",
            "Earth 80%"
        ],
        "location": "Cyclopolis, Mintwallin, Maze of Lost Souls, Dark Pyramid, Folda (hidden cave), Kazordoon (The Horned Fox's hideout), the Plains of Havoc, Point of No Return south of Outlaw Camp, Elvenbane, the depths of Fibula Dungeon (level 50+), cave east from Dwarf Bridge, Foreigner Quarter, Rookgaard Minotaur Hell (not reachable).",
        "behaviour": "Attacks from a distance.A minotaur mage attacks from a distance. A minotaur mage never retreats.",
        "strategy": "Kill them quickly before they attack you with their strong magic combos, they are usually found in groups with other Minotaurs, so Avalanche, GFB or Explosion runes are quite useful to have with you. They are resistant to Energy Damage so keep in mind that those spells won't hurt them much, neither will Earth Damage spells. You may consider to use Invisibility or a Stealth Ring if there are many Minotaurs, as only the Minotaur Mages can see invisible players.\nMages: with a decent Magic Level (around 35), can kill them easily by just rushing in and using Ice Damage spells. This stratagy kills them quickly, and uses very little Mana.\nKnights with a weapon skill of about 55 can kill them in under 5 hits with a decent weapon (e.g. Dwarven Axe). Watch out for the Energy Field spell they cast which can cause great damage if you don't pay attention, along with the potentially fatal Fireball.",
        "loot": [
            "Gold Coin",
            "Carrot",
            "Purple Robe",
            "Leather Legs",
            "Leather Helmet",
            "Minotaur Horn",
            "Minotaur Leather",
            "Torch",
            "Taurus Mace",
            "Wand of Cosmic Energy",
            "Mana Potion",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Occultist",
        "name": "Minotaur Occultist",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/1/1a/Minotaur_Occultist.gif/revision/latest?cb=20141110205404&path-prefix=en",
        "attributes": {},
        "notes": "They are a weaker Minotaur Mage, but one of the tougher monsters in Dawnport.",
        "abilities": [
            "Melee (0-29?)",
            "Heavy Magic Missile (16?-27?)",
            "Fireball (24?-64?)",
            "Energy Field"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 90%",
            "Energy 90%",
            "Earth 100%"
        ],
        "location": "Dawnport Crystal Dungeon.",
        "behaviour": "Unknown",
        "strategy": "Unknown",
        "loot": [
            "Gold Coin",
            "Carrot",
            "Leather Legs",
            "Swampling Club",
            "Mana Potion",
            "Torch",
            "Leather Helmet",
            "Magic Light Wand",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Poacher",
        "name": "Minotaur Poacher",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/a/af/Minotaur_Poacher.gif/revision/latest?cb=20171219235555&path-prefix=en",
        "attributes": {},
        "notes": "They are a weaker Minotaur Archer. Unlike the Minotaur Archer however it does not keep a distance. It will shoot bolts but try to fight in close combat.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 80%",
            "Energy 80%",
            "Earth 80%"
        ],
        "location": "Dawnport Crystal Dungeon",
        "behaviour": "Unknown",
        "strategy": "Unknown",
        "loot": [
            "Gold Coin",
            "Bolt",
            "Chain Armor",
            "Studded Armor",
            "Meat",
            "Crossbow",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur",
        "name": "Minotaur",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/95/Minotaur.gif/revision/latest?cb=20141110205934&path-prefix=en",
        "attributes": {},
        "notes": "Minotaurs are cross-breeds of humans and bulls. They live in great caves where they even build proper towns. Furthermore, they arrange troops that repel every intruder from their empire. Minotaurs are average fighters, but organised as a military squad they can be quite dangerous. A strong half-human, half-bull creature. These creatures can be skinned with an Obsidian Knife. You have around 5% chance to get a Minotaur Leather from a dead body. See also: Minotaur Leather/Skinning.",
        "abilities": [
            "Melee (0-45)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 110%",
            "Holy 90%",
            "Ice 110%",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Mino Hell (Rookgaard), Two outside Bear Room Quest, (Rookgaard) and also 2x on the premium side, Mintwallin, Folda, Minotaur Pyramid, Outlaw Camp, Kazordoon minotaur cave, Plains of Havoc, Elven Bane, Deeper Fibula Dungeon (level 50+ to open the door), Ancient Temple, Maze of Lost Souls, Thais Minotaur Camp, Foreigner Quarter.",
        "behaviour": "A minotaur attacks in melee range. A minotaur never retreats.",
        "strategy": "If you are in Rookgaard, avoid attacking them alone, unless you have Small Health Potions. In the mainland, they should not pose a major threat to a prepared adventurer.",
        "loot": [
            "Gold Coin",
            "Brass Helmet",
            "Chain Armor",
            "Mace",
            "Plate Shield",
            "Sword",
            "Axe",
            "Meat",
            "Minotaur Horn",
            "Minotaur Leather",
            "Bronze Amulet",
            "Shovel",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Execowtioner",
        "name": "Execowtioner",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/ef/Execowtioner.gif/revision/latest?cb=20140614003524&path-prefix=en",
        "attributes": {},
        "notes": "The minotaurs know several sects with several purposes. The mooh'tah masters and the death magicians being the most prominent outside the minotaur society. One of the most secretive sects is what the minotaurs call the high judges. They are the sheriffs, judges and executioners of the minotaurs, combined into a single person. They are almost seen as mythical figures and are structured like a military order and a secret society at once. No one knows who hides beneath their shrouds and masks. They are faceless as justice itself. The requirements to join their order is as unknown as their recruitment process. They rarely talk to outsiders other then to proclaim a sentence. Recently the order has stepped forward from the shadows though and their grandmaster proclaimed a death sentence to all enemies of minotaurhood. This places the high judges into the first lines of battle. In the first encounters not only their battle prowesses could be noticed but it also became alarmingly clear that they are not short in numbers yet no one knows for terrain about their manpower. Another mystery is that there are sects of high judges in almost all notable minotaur colonies and they all seem to follow the orders of a single grandmaster, regardless of the colonies allegiances. How the different sects communicate and coordinate even on different continents is yet another riddle though. It can be said for certain that two high judges will never fight each other in battle but the sect rarely fight in inner minotaur conflicts anyway. Usually they travel alone and pass their sentences on those they find guilty. People may come to them to mediate conflicts or seek justice and the high judges will answer their plea ... for a price. It's commonplace to present the high judges gifts for their expected services. Sometimes a high judge might feel offended by the gift and leave, sometimes he considers it an insult and instantly delivers his sentence for the grievance. So usually the gifts to the judges are quite generous and a high judge can expect free food and lodging wherever he travels. The judges are seemingly bound in their doings by something they call 'the code' which probably is some kind of text with laws. The tricky thing is, that this code as almost everything else concerning the judges is secret. The ordinary minotaur can only guess by the sentences what the code might consider forbidden and what not. This leaves them with only a vague feeling what is forbidden and what not. Considering the often harsh punishment that the judges delver most minotaurs tend to keep it save and stay away from everything that even remotely could be considered a crime. The moniker 'execowtioner' was given them by human adventurers who first encountered the sect. Calling a high judge execowtioner though, is asking him for a death sentence.",
        "abilities": [
            "Melee (0-260)",
            "Whirlwind Throw (0-280)",
            "Death Strike (100-200)"
        ],
        "resistance": [
            "Physical 90%",
            "Death 85%",
            "Holy 100%",
            "Ice 90%",
            "Fire 100%",
            "Energy 90%",
            "Earth 85%"
        ],
        "location": "Oramond Mountain Hideout, Oramond Minotaur Camp (northern camp), Underground Glooth Factory, Oramond Dungeon",
        "behaviour": "Execowtioners fight until death.An execowtioner attacks in melee range. An execowtioner never retreats.",
        "strategy": "Don't let their appearance fool you, as their attacks can be stronger than those of a Behemoth or a Destroyer. Paladins: Throw fire walls on the ground and run around them, while healing constantly, for their distance attacks are very strong. Don't let them touch you, and if that happens, be ready to cast salvation, because their melee attacks may hit more than 400 when you're wearing no shield. Knights: Reach them as soon as possible, as they can spam their strong Whirlwind Throw up to three times in a row if they are not hitting you with Melee. Try to lure them away from other Minotaurs, as their high amount of Hit Points combined with their very strong combos and the attacks from other Minotaurs can spell doom even on the most experienced Knights.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Execowtioner Mask",
            "Minotaur Leather",
            "Great Health Potion",
            "Great Mana Potion",
            "Meat",
            "Small Ruby",
            "Minotaur Horn",
            "Small Topaz",
            "Red Piece of Cloth",
            "Execowtioner Axe",
            "Knight Axe",
            "Crown Armor",
            "Titan Axe",
            "Butcher's Axe",
            "Gold Ingot",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Glooth_Powered_Minotaur",
        "name": "Glooth Powered Minotaur",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/5/50/Glooth_Powered_Minotaur.gif/revision/latest?cb=20171218214814&path-prefix=en",
        "attributes": {},
        "notes": "None.",
        "abilities": [
            "Unknown"
        ],
        "resistance": [
            "Physical 5%",
            "Death 5%",
            "Holy 5%",
            "Ice 5%",
            "Fire 5%",
            "Energy 5%",
            "Earth 5%"
        ],
        "location": "Second floor Glooth Underground Factory, east side during a minotaur raid.",
        "behaviour": "It fights in close combat like a stronger Moohtant.",
        "strategy": "This creature cannot be killed in this form, however, it can be weakened into a Depowered Minotaur. To do so, lure the Glooth Powered Minotaur to one of the many Glooth Extractors around the cave. It will become a Depowered Minotaur as soon as it steps on it, and the weak version can be easily killed. Note that if there are Minotaur Totems around, you should deal with them first since they heal all creatures around it.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Amazon",
        "name": "Minotaur Amazon",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/02/Minotaur_Amazon.gif/revision/latest?cb=20140613171035&path-prefix=en",
        "attributes": {},
        "notes": "The minotaur amazons are an all-female minotaur sect that revere the great mother, also known as holy cow. They consider themselves as the mothers of the minotaur nations and are extremely protective about them. In former days the amazon were respected healer-preachers of their faith and even tiny settlements often had a crone, providing knowledge and healing to those in need. Less prone to rage then their male counterparts they often worked as spiritual advisors and were responsible to calm those lost in their rage. Since the latter could be quite dangerous the amazons always received some form of combat training. After years of peaceful stagnation, the raising threats and pressure to minotaur societies led to a change though. Ralda, a wandering priestess took it upon her to renew their faith and change it through new doctrines. The peaceful and rather passive role switched gradually into a more protective and active one. The combat training became more emphasized and the amazons began to accompany their people into battles. This change gained more and more in momentum by it success and was at last adapted even by societies that never had come into contact with Raldo themselves. With this change what in the past had been an informal group of like minded people, became also a more and more formalized order. To become an amazon a minotauress had to be mother of at least four calves. Though they server the ties to their former families they renew them by becoming the mothers of all their people, sworn to treat and protect their nation like they did for their own former families. The amazons, though skilled fighters are also the caretakers and healers for their brethren and sisters. They are well educated and schooled not only in battle but also in tactics, logistics and several other topics important for the survival of their society. Most of them are skilled moohsicians, which is the title of the most skilful singers of the society and arguments between amazons are often settled in singing contests. Amazons are loyal for their nation first and their race second. They fight side by side with their nation even against other minotaur societies.",
        "abilities": [
            "Melee (?)",
            "Throws Spears (0-200+) Minotaur Amazon"
        ],
        "resistance": [
            "Physical 100%",
            "Death 90%",
            "Holy 90%",
            "Ice 95%",
            "Fire 105%",
            "Energy 110%",
            "Earth 100%"
        ],
        "location": "Underground Glooth Factory, Oramond Minotaur Camp, Oramond Dungeon",
        "behaviour": "It fights from a distance throwing spears at its target.A minotaur amazon attacks from a distance. A minotaur amazon will retreat at 260  (10%, red) health.",
        "strategy": "Watch out when its health becomes red because it will run away and chasing it may lure you into more creatures.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Ham",
            "Cowbell",
            "Minotaur Leather",
            "Great Mana Potion",
            "Great Health Potion",
            "Meat",
            "Minotaur Horn",
            "Small Amethyst",
            "Small Ruby",
            "Small Topaz",
            "Small Emerald",
            "Mino Shield",
            "Assassin Star",
            "Ring of Healing",
            "Mino Lance",
            "Stone Skin Amulet",
            "Warrior Helmet",
            "Red Piece of Cloth",
            "Bullseye Potion",
            "Yellow Gem",
            "Red Gem",
            "Gold Ingot",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Hunter",
        "name": "Minotaur Hunter",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/d/df/Minotaur_Hunter.gif/revision/latest?cb=20150207010042&path-prefix=en",
        "attributes": {},
        "notes": "The minotaur hunters are not committed to hunt for food but rather to act as scouts and eliminate dangers for the minotaur society. Expert trackers and big game hunters they shun other distance weapons then the spear. They are equally skilled in throwing their spears as in wielding them in battle and as they are trained in some minotaur form of paladin knowledge they are able to conjure them on their own in time of need. A hunter's training begins early in life and requires a certain dedication as the tests of skill and endurance are increasingly challenging from year to year. Each year a number of candidates is rejected and sent to other duties often to the army where their skills are welcome. So many minotaur soldiers possess some grade of schooling in outdoorsmanship. Those who pass all tests are welcomed into the local hunters' lodges. As other societies in minotaur civilization, the hunters are rather secretive about the rituals and secret knowledge of their lodges so little is known beyond the obvious. Only fully accepted hunters are taught the last secrets of the lodges, as certainly several spells to hone their skills. They are also schooled in the anatomy of different species to inflict maximum damage by exploiting weak spots. This is especially handy when fighting larger creatures that are usually only engaged by groups of hunters. Such groups are formed permanently and each hunter belongs to one. The number of members usually differs from five to fifteen with a group size of eight being the standard. A group with fewer than five members is disbanded and the remaining hunters are split between other groups. Still hunters are also sent on solo missions, especially when working for the army. They are the scouts, lookouts and responsible for the choice of camp-sites of a marching army. In Battle they are usually hold back as most minotaur generals yet lack to see their usefulness in open battles. Employed as a group in tandem with an army they are used to harass the enemy, spy on it's move and sabotage their resources. The minotaur hunters really shine though, when it comes to hunt great beasts of the deep such as dragons and behemoths. That is where their training kicks in most and provides groups of hunters with the knowledge and momentum to overcome seemingly overpowered foes. Though formerly seen rarely in combat with other the beasts, some smaller and newer minotaur communities rely less and less on a formalized army and according battle tactics. Their troops see a greater number of hunters employed on the battlefield with their combat style working more then well with the skirmish approach that such communities usually employ.",
        "abilities": [
            "Royal Spear Throw (causes Bleeding ) (0-200) Minotaur Hunter",
            "Explosion (0-200)",
            "Groundshaker (0-43+)",
            "Throwing Knife 3x3 area attack (0-134+)",
            "Self-Healing (0-250+)",
            "Haste"
        ],
        "resistance": [
            "Physical 100%",
            "Death 100%",
            "Holy 90%",
            "Ice 105%",
            "Fire 90%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Oramond/Southern Plains, Minotaur Hills, Oramond Dungeon (depending on Magistrate votes), Underground Glooth Factory",
        "behaviour": "A minotaur hunter attacks from a distance. A minotaur hunter will retreat at 56 to 419 (4% - 29.93%, red) health.",
        "strategy": "Their explosion attack is where you'll probably get most damage from. They are usually not a huge threat when they're alone but in groups they quickly become very dangerous. It is suggested to take out any other creatures present before attempting to kill the Minotaur Hunter as they can flee and lure you into an army of other minotaurs. When they haste they are about as fast as a level 160. An energy wall thrown behind their back will block their escape.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Hunting Spear",
            "Blank Rune",
            "Royal Spear",
            "Strong Mana Potion",
            "Strong Health Potion",
            "Soul Orb",
            "Minotaur Horn",
            "Minotaur Leather",
            "Small Ruby",
            "Small Amethyst",
            "Stealth Ring",
            "Green Piece of Cloth",
            "Blue Piece of Cloth",
            "Red Piece of Cloth",
            "Mino Shield",
            "Yellow Gem",
            "Red Gem",
            "Minotaur Trophy",
            "Mooh'tah Plate",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Mooh%27Tah_Warrior",
        "name": "Mooh'Tah Warrior",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/e1/Mooh%27Tah_Warrior.gif/revision/latest?cb=20240228103111&path-prefix=en",
        "attributes": {},
        "notes": "The mooh'tah warriors are elite soldiers that dedicated their life to the philosophical teachings of this ancient minotaur philosophy. While each minotaurs is taught the basic principles of the mooh'tah only a few chosen are able to follow its teachings truly. They basic principles are meant to help the minotaurs to ease their inner rage, which is considered as unclean and offensive. The ultimate goal is to not only master the inner anger but dissolve it into spiritual energy. The ultimate idea is instead of dedicating energy to fight the anger, in the end the anger becomes additional energy and therefore supply of enormous power. Since the true path of mooh'tah requires not only dedication but also time and resources, it's usually the nobility that can afford to indulge the studies. While the first lessons are basic and primary consists of philosophic teachings, soon also the body is honed. Beginning with breathing techniques and continuing with the correct way to move, the training becomes over the years more and more martial. As the first lessons teach the spirit and the body to become one, the higher teachings concern the flow of magic and making a weapon a part of their body. The great goal is the unity with the world. This goal is never truly accomplished though and only a few mooh'tah masters are even attempting the impossible and instead concentrate more on their martial progress. This self centred usage of the mooh'tah is considered sinful and false by a few purists. Those usually live as hermits away from minotaur society that they see as rotten and misguided. Still they are often sought out by students that ask for guidance but more often then not those are brusquely turned away. Though their disapproval of minotaur society is well known the hermits are held in high regard by the populace. The more worldly mooh'tah masters are usually part of the local military hierarchy and sometimes form highly valued elite squads within an army. Extremely efficient and unyielding fighters they serve as inspiration for the common troops and sometimes one mooh'tah master alone is enough to turn the tides of battle. Skilled in the art of war and in possession of secret magic they are the epitome of all that a minotaur could want to be. Towards non minotaurs that are obviously not even aware of the principle of mooh'tah they usually only feel disgust, but it would be of course beneath a true master to show that.",
        "abilities": [
            "Melee (0-200+)",
            "Energy Beam (0-162+)",
            "Berserk",
            "Dizzyness thing (0-132?+)",
            "Self-Healing (0-159+)"
        ],
        "resistance": [
            "Physical 95%",
            "Death 85%",
            "Holy 100%",
            "Ice 90%",
            "Fire 85%",
            "Energy 95%",
            "Earth 90%"
        ],
        "location": "Oramond/Southern Plains, Minotaur Hills, Oramond Dungeon (depending on Magistrate votes), Underground Glooth Factory",
        "behaviour": "Mooh'Tah Warriors never retreat.A mooh'tah warrior attacks in melee range.",
        "strategy": "Fairly slow creatures. However, they should not be underestimated in close combat. Stay diagonal to avoid their beams.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Mooh'tah Shell",
            "Strong Mana Potion",
            "Strong Health Potion",
            "Minotaur Leather",
            "Small Ruby",
            "Small Emerald",
            "Small Amethyst",
            "Small Topaz",
            "Minotaur Horn",
            "Cowtana",
            "Sword Ring",
            "Mooh'tah Plate",
            "Guardian Shield",
            "Knight Legs",
            "Red Piece of Cloth",
            "Knight Armor",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Moohtant",
        "name": "Moohtant",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/1/1c/Moohtant.gif/revision/latest?cb=20171218214813&path-prefix=en",
        "attributes": {},
        "notes": "Minotaurs are born with a great inner rage that constantly threatens to drive them over the edge and turn them into berserkers that know no friend or foe, all the less concern for their own health or even some form of strategy. This state of mind is considered unclean by the minotaurs and their society had come up with several ways to cope with this problem. Yet no minotaur would foolishly deny that this inner rage is a constant companion in a minotaurs life. Sometimes this rage manifests in especially cruel ways. Some tragic minotaurs are born 'into the rage' as the minotaurs say. They never have a chance to battle their inner rage but are born into the world with fierce anger and bloodlust. Those young calves are taken into custody by special trainers, most of the high ranking mooh'tah masters. They train the youngsters to at least control somewhat of their rage and funnel it into certain tiresome and draining tasks. This upbringing with mining, hauling and woodcutting from the earliest age combined with the constant burning energy in them, lets them grow out of the proportions of normal minotaurs. Often easily twice as high as a minotaur this veritable giants are more beast then civilized minotaur. Regardless of the strictness of their upbringing they never grasp concepts of society. They never develop the ability of speech and only communicate through moohing sound to express simple emotions. Yet they understand simple commands and therefore are used as powerful work-machines and dangerous weapons in combat. Despite their strength and arguably usefulness they are shunned and despised by minotaur society. They are the lowest of the low and mistrusted. Oddly enough their handlers and trainers are usually regarded with admiration, because they take it upon them to handle the unclean so that the rest of the society can ignore their existence. Hardly more intelligent then a dog and only able to use the most simple tools and weapons the moohtants, as they are called by humans, are rarely deployed in battle unless times are very desperate. While the rulers of civilized places like Mintwalin tend to tow them away out of sight and use them in remote mines, younger communities can't afford such luxury and use their power with often dangerous frequency.",
        "abilities": [
            "Melee (0-290)",
            "Berserk (0-200)",
            "Life Drain Bomb (100-225)",
            "Self-Healing (50-145)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 90%",
            "Holy 100%",
            "Ice 85%",
            "Fire 95%",
            "Energy 85%",
            "Earth 0%"
        ],
        "location": "Oramond Mountain Hideout, Oramond Minotaur Camp (northern camp), Underground Glooth Factory, Oramond Dungeon",
        "behaviour": "Moohtants fight until death.A moohtant attacks in melee range. A moohtant never retreats.",
        "strategy": "This creature's strength can be compared with a Behemoth or a Destroyer. A Garlic Necklace is affordable and will greatly reduce the power of their Life Drain Bomb. Paladins: Throw fire walls on the ground and run around them while healing constantly, for their distance attacks are strong. Don't let them touch you, and if that happens, be ready to cast salvation, because their melee attacks may hit a lot. \nUsually they are no problem for a paladin level 120+, due to their slow speed, altough they can be killed by lower levels if there's no more creatures onscreen. Knights: Not a very recommendable creature for Knights, as they do quite heavy damage and take some time to kill, risking being swarmed by other Minotaurs. If you still wish to do so, try to lure them away so you don't get surrounded by Mooh'Tah Warriors, Execowtioners or distance fighters, specially Worm Priestesses, which can deal a lot of damage while you try to kill the Moohtant.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Moohtant Horn",
            "Giant Pacifier",
            "Great Health Potion",
            "Great Mana Potion",
            "Meat",
            "Small Ruby",
            "Small Diamond",
            "Minotaur Leather",
            "Ring of Healing",
            "Red Piece of Cloth",
            "Moohtant Cudgel",
            "Red Gem",
            "Spiked Squelcher",
            "Yellow Gem",
            "Gold Ingot",
            "Chaos Mace",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Worm_Priestess",
        "name": "Worm Priestess",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/9/93/Worm_Priestess.gif/revision/latest?cb=20140613170134&path-prefix=en",
        "attributes": {},
        "notes": "The worm priests revere the great worm of legend, that lead several families of minotaurs from oppression in Mintwalin to a land that should be theirs to conquer. Although foremost prominent in the mentioned new founded kingdom the teachings of the great worm had a lure in several minotaur communities. Associated with freedom and renewal the cult is mostly disliked by officials and often forbidden. Such laws though sparked even more interest in the teaching that the rules deemed obviously to dangerous for their subjects to know. In reality most worm priests are individualists and self-proclaimed prophets that the great worm entrusted with special insights. There is no true unified church of the worm yet and even the few things that are considered basic teachings are up to interpretation. Most worm priests are highly skilled alchemists first, preachers second and always also accomplished magicians, often for some reasons defectors of the death cult. Most of their displayed miracles are product of their elixirs and salves, others are easily recognized as some basic magic. It's quite rare that worm priests work together. Whenever this occurs usually a very potent worm priest had unified them by force and guile and is pulling their strings. As a unified cult has yet to emerge, fights amongst worm priests and their followers against another sect of the cult are common and usually bloody. All sects regard Harraz, the first prophet of the worm as holy but even in the interpretation of the few of his passed down words there is no agreement. For now the cult is strongest in the clans of ZZZ where it originated. Since a triumvirate had been established as leadership it is in a good position to endure, but arguments in this inner circle makes progress slow and tedious.",
        "abilities": [
            "Energy Strike (0-170+)",
            "Death Bomb (0-200+)",
            "Poison Bomb (0-300+)",
            "Red sparkles on themselves (?)",
            "Small Wave (Causes heavy Paralysis )",
            "Small Stone Life Drain (0-110+)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 95%",
            "Holy 100%",
            "Ice 95%",
            "Fire 90%",
            "Energy 100%",
            "Earth 80%"
        ],
        "location": "Oramond/Southern Plains, Minotaur Hills, Oramond Dungeon (depending on Magistrate votes), Underground Glooth Factory, Oramond Fury Dungeon",
        "behaviour": "A worm priestess attacks from a distance. A worm priestess never retreats.",
        "strategy": "Their poison bomb is their most powerful attack. It is suggested to wear equipment which reduces poison damage. It is also suggested to take them out before killing any other minotaurs, as they tend to make the most damage among their kin.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Purple Robe",
            "Strong Mana Potion",
            "Snakebite Rod",
            "Taurus Mace",
            "Torch",
            "Minotaur Leather",
            "Minotaur Horn",
            "Small Amethyst",
            "Small Topaz",
            "Small Diamond",
            "Small Emerald",
            "Small Sapphire",
            "Small Ruby",
            "Blue Piece of Cloth",
            "Underworld Rod",
            "Green Piece of Cloth",
            "Red Piece of Cloth",
            "Yellow Gem",
            "Red Gem",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Cult_Follower",
        "name": "Minotaur Cult Follower",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/f/f2/Minotaur_Cult_Follower.gif/revision/latest?cb=20170803134430&path-prefix=en",
        "attributes": {},
        "notes": "The Minotaur Cult Follower is a stronger version of Minotaurs.",
        "abilities": [
            "Melee (0-250)",
            "Smoke Berserk (0-300) Minotaur Cult Follower",
            "Green Sparkles (unknown maybe buff) Minotaur Cult Follower",
            "Self-Healing (105-196)"
        ],
        "resistance": [
            "Physical 100%",
            "Death 110%",
            "Holy 90%",
            "Ice 110%",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Minotaurs Cult Cave",
        "behaviour": "It looks like a regular Minotaur but it's much stronger. You can skin its corpse using an Obsidian Knife to get a Minotaur Leather.A minotaur cult follower attacks in melee range. A minotaur cult follower never retreats.",
        "strategy": "If possible, keep your distance to avoid its melee attacks.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Ham",
            "Cowbell",
            "Plate Shield",
            "Cultish Robe",
            "Bronze Amulet",
            "Minotaur Horn",
            "Mino Shield",
            "Great Health Potion",
            "Minotaur Leather",
            "Meat",
            "Ring of Healing",
            "Small Ruby",
            "Small Emerald",
            "Small Amethyst",
            "Small Topaz",
            "Mino Lance",
            "Gold Ingot",
            "Red Piece of Cloth",
            "Warrior Helmet",
            "Yellow Gem",
            "Minotaur Trophy",
            "Red Gem",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Cult_Prophet",
        "name": "Minotaur Cult Prophet",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/e/e9/Minotaur_Cult_Prophet.gif/revision/latest?cb=20170718003145&path-prefix=en",
        "attributes": {},
        "notes": "The Minotaur Cult Follower is a stronger version of Minotaur Mages. It looks like a Minotaur Mage but it's much stronger and attacks at close range. You can skin its corpse using an Obsidian Knife to get a Minotaur Leather.",
        "abilities": [
            "Melee (0-200)",
            "Small Fire Ball (100-300) Minotaur Cult Prophet",
            "Energy Missile (200-350) Minotaur Cult Prophet",
            "Mass Healing that also heals his allies (100-250) Minotaur Cult Prophet"
        ],
        "resistance": [
            "Physical 100%",
            "Death 105%",
            "Holy 90%",
            "Ice 110%",
            "Fire 100%",
            "Energy 80%",
            "Earth 80%"
        ],
        "location": "Minotaurs Cult Cave",
        "behaviour": "Unlike Minotaur Mages, they fight in close combat. They can heal themselves as well as their allies.A minotaur cult prophet attacks in melee range. A minotaur cult prophet never retreats.",
        "strategy": "If possible, keep your distance to avoid its melee attacks. Be careful because it can use high damage combos.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Ham",
            "Cowbell",
            "Great Mana Potion",
            "Minotaur Horn",
            "Minotaur Leather",
            "Cultish Robe",
            "Small Emerald",
            "Moonlight Rod",
            "Meat",
            "Small Topaz",
            "Great Health Potion",
            "Small Ruby",
            "Small Amethyst",
            "Ring of Healing",
            "Gold Ingot",
            "Red Piece of Cloth",
            "Minotaur Trophy",
            "Red Gem",
            "Yellow Gem",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Cult_Zealot",
        "name": "Minotaur Cult Zealot",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/b/ba/Minotaur_Cult_Zealot.gif/revision/latest?cb=20210420152025&path-prefix=en",
        "attributes": {},
        "notes": "The Minotaur Cult Follower is a stronger version of Minotaur Guards. It looks like a Minotaur Guard but it's much stronger. You can skin its corpse using an Obsidian Knife to get a Minotaur Leather.",
        "abilities": [
            "Melee (0-250)",
            "Axe Throw (0-350) Minotaur Cult Zealot",
            "Smoke Beam (0-250+) Minotaur Cult Zealot"
        ],
        "resistance": [
            "Physical 100%",
            "Death 110%",
            "Holy 90%",
            "Ice 110%",
            "Fire 80%",
            "Energy 100%",
            "Earth 100%"
        ],
        "location": "Minotaurs Cult Cave",
        "behaviour": "Fights in close combat.A minotaur cult zealot attacks in melee range. A minotaur cult zealot never retreats.",
        "strategy": "If possible, keep your distance to avoid its melee attacks. When in close combat stay diagonal to avoid its beam.",
        "loot": [
            "Gold Coin",
            "Platinum Coin",
            "Purple Robe",
            "Snakebite Rod",
            "Strong Mana Potion",
            "Cultish Robe",
            "Taurus Mace",
            "Minotaur Leather",
            "Small Amethyst",
            "Small Emerald",
            "Small Diamond",
            "Small Sapphire",
            "Minotaur Horn",
            "Red Piece of Cloth",
            "Small Topaz",
            "Small Ruby",
            "Yellow Gem",
            "Red Gem",
            "Minotaur Trophy",
            "Loot Statistics"
        ]
    },
    {
        "url": "https://tibia.fandom.com/wiki/Minotaur_Idol",
        "name": "Minotaur Idol",
        "image_url": "https://static.wikia.nocookie.net/tibia/images/0/07/Minotaur_Idol.gif/revision/latest?cb=20170802135501&path-prefix=en",
        "attributes": {},
        "notes": "It looks like a Glooth Powered Minotaur or a Moohtant with different colours.\n12 Minotaur Statues will come to life in the form of Minotaur Idols after you enter The False God's room during the Cults of Tibia Quest.",
        "abilities": [
            "Melee (0-300?)"
        ],
        "resistance": [
            "Physical 100%?",
            "Death 100%?",
            "Holy 100%?",
            "Ice 100%?",
            "Fire 75%",
            "Energy 100%?",
            "Earth 100%?"
        ],
        "location": "Minotaur Cult hideout near Mintwallin.",
        "behaviour": "They fight in close combat until death.",
        "strategy": "Treat it as a strong melee creature and kill it fast before the other statues come to life.",
        "loot": [
            "Loot Statistics"
        ]
    }
]